Sindbad’s Coconut drink
Sindbad’s seven voyages have been the most unpredictable, surprising and
exciting tale of the book. The most common thing in all the voyages is that
coconut water or raw coconut always helps him. Let’s see if this recipe is
quenching enough to refresh you in the warm summers on beaches.
Serving size: 2
Cooking time: 10 minutes
Ingredients:
Milk ¾ cup
Greek yogurt ½ cup
Oats ¼ cup
White sugar 1 tablespoon
Shredded coconut ¼ cup
Ground flaxseed 2 tablespoons
Coconut milk ¼ cup
Banana 1 (cut into chunks)
Instructions:
In a blender, put the sugar, flaxseed, shredded coconut, coconut milk, oats,
yogurt, milk, and banana and blend well until it becomes smooth.
Pour in two glasses and put them in the refrigerator for an hour.
Serve chilled.
Marjina’s Special drink for the guests
When Alibaba invited the forty thieves as his guests, Marjina prepared a
special drink for them. She mixed some drugs in the drink to get the drink
to blackout the thieves. However, this drink had some special ingredients to
recharge the energy of Alibaba and his sons. Try our recipe and feel how
you get energized after sipping it. 
Serving size: 1
Cooking time: 5 minutes
Ingredients:
Orange water 2 drops
Mint leaves 4
De-stoned nectarine ½
Schweppes mango and orange mineral water
Mint sprig (for garnishing)
Instructions:
Add the mint leaves, orange water drops, and nectarine into a big glass.
Muddle it.
Add the ice and stir. Top it with the Mango and Orange Mineral Water.
Serve chilled.
Scheherazade’s Tahini Salad
Scheherazade is an elegant princess, and she did not eat much. Her picky
habits of eating made the royal staff prepare something wholesome, light
and tasty. Moreover, she didn’t want to feel drowsy so that she could
continue her legendary tale every night. This recipe includes vegetables in
rich seasoning to make you full without being lazy.
Serving size: 4
Cooking time: 30 minutes
Ingredients:
Diced large tomato 1
Sliced mint leaves 10
Minced garlic 1 clove
Lemon juice ¼ cup
Olive oil 2 tablespoons
Tahini ¾ cup
Sliced green onion 1
Chopped parsley ⅓ bunch
Diced Persian cucumbers pickle-size 2
Diced radishes 3 (optional)
Salt to taste
Instructions:
Combine the parsley, mint, green onion, radish, tomato, and cucumber in a
small bowl.
In another bowl, add the olive oil, lemon juice, tahini, and garlic and stir.
Season it with salt as per your taste.
Toss these vegetables along with dressing until it is combined well.
Cover the bowl. Then, put it in the refrigerator for at least 30 minutes. Serve
chilled.
Baba Ghanoush
There are numerous dishes on the tables of the elite of Baghdad.
Scheherazade takes the readers to the wonderland of food through her tales.
This side dish also has its inspiration from the sauces presented with
exclusively roasted lambs and camels.
Serving size: 8
Cooking time: 6 minutes
Ingredients:
Tahini 2 tablespoons
Lemon juice ¼ cup
Olive oil ⅓ cup
Salt to taste
Large eggplant 1
Minced garlic 1 tablespoon
Instructions:
Use a paring knife’s tip to pierce the eggplant five times.
Microwave the pierced eggplant for 8 minutes and until softened.
Remove from the microwave and put on the plate. Allow it to cool until
room temperature.
Discard the stem and peel off its skin and discard it too.
Chop it now and place it into a blender and blend well along with olive oil,
garlic, lemon juice, and tahini and puree.
You can also add water to it if needed.
Season with salt to taste. Enjoy.
Hummus
Variety and innovation are the two main features of the lifestyle we see in
Arabian Nights. Even the king started liking Scheherazade because of her
variations in the story. Here is another variation of dip. You may eat this
versatile dip with some fried snacks or as it is.
Serving size: 4
Cooking time: 5 minutes
Ingredients:
Olive oil 1 tablespoon
Drained garbanzo beans 1 can (reserve the liquid)
Crushed garlic 1 clove
Salt ½ teaspoon
Sesame oil 2 drops or to taste
Lemon juice 1 tablespoon
Ground cumin ½ teaspoon
Instructions:
Blend the sesame oil, salt, cumin, garlic, olive oil, lemon juice, and
garbanzo beans in the food processor.
Stream the liquid reserved from the beans in that mixture, too, as you blend
it.
Keep blending until you achieve the desired consistency and enjoy.
Tabouleh
The inns of Baghdad were the hubs of socializing in ancient times. Poets
and merchants used to spend nights sharing their ideas and stories. One of
the favorite dishes of the people visiting the inns is Tabouleh. Eat it as a
salad with some mutton dishes or with rice.
Serving size: 10
Cooking time: 1 hour 30 minutes
Ingredients:
Boiling water 3 cups
Diced tomatoes 2 lb.
Minced green onions 3
Chopped fresh parsley 1 cup
Fresh lemon juice ¼ cup
Olive oil 3 tablespoons
Minced fresh mint leaves ¼ cup
Bulgur 1 ½ cups
Ground black pepper to taste
Salt to taste
Instructions:
Take a casserole dish and place bulgur in it along with three cups of boiling
water; cover it.
Keep it on the heat until the water gets absorbed. It will take around 30
minutes.
Use a fork to fluff the bulgur.
Add the pepper, salt, lemon juice, olive oil, mint, green onions, parsley, and
tomatoes in it and stir them to combine well.
Cover it and refrigerate for two hours.
You can serve it at room temperature or chilled. 
The Classic Mutabal
This spicy dip has its inspiration from the Indian princess who fell in love
with the dumb prince in one of the tales from Arabian Nights. She
introduced many dishes in Basra. Here is the recipe of one sauce that is
inspired by her dishes. Try it to impress your family and friends.
Serving size: 4
Cooking time: 15 minutes
Ingredients:
Eggplant 1
Lemon Juice 1 tablespoon
Chopped garlic 2 teaspoons
Chopped onion ¼ cup
Tahini 2 tablespoons
Greek Yogurt 2 tablespoons
Extra Virgin Olive Oil 2 tablespoons
Salt to taste
Pomegranate kernels as needed
Coriander as needed
Instructions:
Wash an eggplant. Pat it dry.
Make some incisions on that eggplant. Then, roast it on the gas stove
directly, or you may do it in the oven until the skin becomes black; the flesh
of the eggplant becomes soft.
Remove the black skin from the eggplant.
Put the remaining ingredients and the flesh in the blender.
Blend all of the ingredients until they make a soft and smooth dip.
Garnish the dip with pomegranate kernels, coriander, and olive oil.
Serve it with crackers such as pita or some other cracker. Enjoy.
Falafel
This is one of the most popular Arab dishes, but it has roots in the
legendary book of Arabian Nights. When the Moroccon merchant married a
slave girl, he invited the elite of the city to a grand dinner at his place.
Chickpea kebabs were part of the menu in the feast. This dish is the refined
form of the chickpea kebabs.
Serving size: 6
Cooking time: 15 minutes
Ingredients:
Vegetable oil for frying 2 lb. or as needed
Egg 1
Minced garlic 3 cloves
Baking powder 2 teaspoons
Peanut oil 2 teaspoons
Ground cumin 1 teaspoon
Cayenne pepper 1 pinch
Salt 1 teaspoon
Hot sauce to taste
Drained pinto beans 1 can
Chopped small green bell pepper 1
Quartered onion 1
Dry taco seasoning mix 1 package
Dry bread crumbs 1 cup or as needed
Instructions:
Take a big saucepan or a deep fryer and heat the vegetable oil in it up to 375
F.
Put the cayenne pepper, salt, cumin, peanut oil, baking powder, taco
seasoning, garlic, egg, green bell paper, and onion in the food processor or
blender. Puree until it becomes smooth.
Put the beans into the mixture. Pulse the beans until integrated and
chopped, but do not make them smooth.
Put the bean mixture in a big bowl.
Put hot sauce in the mixture and stir.
Put bread crumbs in the mixture so that dough is formed, which holds
together (it should not be sticky).
Give balls like shape to the dough of quarter size.
Fry in the oil until they become golden brown in color. It will take about 5
minutes.
Serve hot.
Breakfasts and Snacks
Arayes
When the king didn’t kill princess Scheherazade because she made him
curious to know the end of the story, she was on cloud nine. Her father
visited her with her favorite breakfast and became happily surprised to see
his daughter alive. The food he brought from home contains this legendry
dish. Try it out to see if it fits the taste of our beloved princess.
Serving size: 6
Cooking time: 1 hour
Ingredients:
Ground beef/lamb 1 ½ lb.
Baharat 1 teaspoon
Ground cumin ½ teaspoon
Salt 1 teaspoon
Black pepper 1 teaspoon
Olive oil 2+5 tablespoons
Finely chopped medium onion 1
Finely chopped parsley 1 cup
Pitas 12
Toasted pine nuts ¼ cup (optional)
 Instructions:
Take a big bowl and put cumin, olive oil, baharat, pepper, salt, chopped
parsley, chopped onion, and beef along with pine nuts. Mix all the
ingredients well.
Cut all the pitas in halves. Fill each pita with a 0.13 lb. meat mixture.
Brush the olive oil on both sides of a pita.
Take a striped frying pan, put on high heat, and fry the pitas—Fry for two
minutes on each side.
Serve hot with tahini and fresh salad.
Baklava
When Alibaba became rich, he hosted a grand dinner at his new palace to
socialize with the elite of Baghdad. His wife cooked a special sweet dish for
the guests. You may find it on the menu of many Arab or Turkish
restaurants now. However, this recipe gives you the true taste of Arabian
Nights.
Serving size: 36
Cooking time: 30 minutes
Ingredients:
White sugar ½ cup
Margarine 5 tablespoons
Vegetable oil 5 tablespoons
White sugar 3 ½ cups
Ground cinnamon 1 tablespoon
Walnuts 1 lb.
Water 2 cups
Lemon juice 2 tablespoons
Phyllo dough 1 package
Instructions:
Preheat the oven to about 350 F. Take a 9x13-inch pan for baking and
grease lightly.
Cut the phyllo dough into the size of the greased pan and put half of the
sheets in the pan.
Grind sugar, cinnamon, and walnuts in a blender or a food processor.
Put the ground mixture of walnut on the phyllo.
Now, put the rest of the phyllo sheets on this walnut mixture’s top.
Take a small saucepan and put it on low heat. Melt margarine along with oil
in the pan.
Make the diamond shape of the top phyllo layers using a very sharp knife.
Bake it in the preheated oven for at least 30 minutes or until it becomes
golden brown in color.
On the other side, make syrup for baklava.
Combine the lemon juice, water, and sugar on medium heat in a big
saucepan.
Boil it and then remove it from the heat. Let it cool a little.
Remove the baklava from the oven. Pour the prepared soup over the hot
pastry.
Cool it completely, then serve.
Ful (Fool) Mudammes
Culinary skills for the female monarchy were as important as warcraft for
the males in the ancient Iraqi, Syrian and Arab cultures. This is why our
princess Noor- Ul- Sabaah prepared this scrumptious delicacy for her
husband. Give it a try, and your taste buds are sure to be happy.
Serving size: 5
Cooking time: 10 minutes
Ingredients:
Plain fava beans 2 cans
Water ½ cup
Ground cumin 1 teaspoon
Kosher salt to taste
Chopped garlic cloves 2
Diced tomato 1
Chopped parsley 1 cup
Extra virgin olive oil as needed
Lemon juice 2 tablespoons
Chopped hot peppers/ jalapenos 2
Green onions as needed
Sliced cucumbers as needed
Warm pita bread as needed
Sliced tomatoes as needed
Olives as needed
Instructions:
Take a saucepan or an iron skillet. Add water and the fava beans into it.
Warm the fava beans on medium heat.
Season with the cumin and kosher salt. Mash the fava beans using a fork or
potato masher.
Take the garlic and hot peppers and put them in the mortar and pestle.
Smash them. Then, add the lemon juice. Stir to combine.
Put the pepper and garlic sauce on the fava beans.
Drizzle the extra virgin olive oil on it.
Garnish with the diced tomatoes, hot peppers, olives, and chopped parsley.
Serve it with the sliced veggies and pita bread. Enjoy.
Princess Jasmine’s Favorite Manakeesh
When Aladdin returned from a hunting trip, Princess Jasmine ordered a
special feast for him and his squad. Manakeesh is what they served with the
roasted animals they had brought for their successful hunting trip. This
recipe is the best in town.
Serving size: 6
Cooking time: 12 minutes
Ingredients:
For the Dough
Salt 1 teaspoon
All-purpose flour 3 cups
Granulated sugar 1 teaspoon
Warm water 1 cup
Instant yeast 1 tablespoon
Olive oil 2 tablespoons
For Zaatar Spread
Olive oil ¼ cup
Zaatar 1/3 cup
Instructions:
For making the dough
First, take a big bowl and stimulate the yeast in the warm water. It will take
10 minutes to proof.
Add the olive oil, sugar, and salt into the bowl. Mix them well using a
wooden spoon until combined.
After a few moments, add flour to these ingredients. Mix using a spoon.
Mix well until the dough is shaggy.
Take the dough to some floured surface.
Next, knead this dough using the hand until you get the tight ball of dough.
Put the dough into an oil-coated bowl.
Cover the dough using a towel or a plastic wrap. Set it aside at room
temperature. It will rise in about 50-60 minutes.
For making the Zaatar Spread
Take a small bowl. Then, mix the olive oil and zaatar to make a spreadable
and consistent mixture.
Assembling and baking
Preheat the oven to about 450° F.
Use parchment paper to line the baking sheet.
Next, make six parts of the dough.
Spread every piece using your fingers and make a flat round disc with a
thickness of around 1.4 inches.
Put the zaatar spread ( a tablespoon or two) on each piece and spread the
zaatar evenly.
Place them on the baking sheet.
Then, bake in the oven for 12 minutes until your dough gets golden brown.
Enjoy it with vegetables and cheese.
Shawarma
Merchants of Basra and Kufa used to carry their food with them while
going on journeys. Mostly, they used to eat their food on the camelback
while traveling. Shawarma was their most favorite go-to food because it
was a full meal, and they could have it without stopping. You may have
tried it at some fast-food shops, but our variation has the authentic Arab
vibes.
Serving size: 4
Cooking time: 10 minutes
Ingredients:
Plain yogurt 1 cup
Ground cumin 1 teaspoon
Tomato paste 1 tablespoon
Salt ½ teaspoon
Red pepper flakes ¼ teaspoon
Ground black pepper ½ teaspoon
Boneless chicken breasts (skinless) 2 lb. (cut them in ½ inch
strips)
Ground coriander 1 teaspoon
Olive oil 2 tablespoons
Lemon juice ¼ cup
Minced garlic cloves 3
Instructions:
Whisk the red pepper flakes, salt, pepper, coriander, cumin, garlic, tomato
paste, olive oil, lemon juice, and yogurt in a medium-size bowl. Then, add
the chicken strips.
Cover the bowl using a plastic wrap. Put it in a refrigerator for at least 8
hours to marinate.
Preheat the broiler of the oven and put the rack away from a heat source, at
least 6 inches.
Remove bowl from the refrigerator and put the chicken in the broiling pan,
making a single layer. Excess margination can be discarded at this point.
Broil the chicken for at least 10 minutes or until juices are clear.
Serve it as a sandwich in the warmed flatbread. You can also serve seeded
tomato, sliced onion, and cucumber sauce with it. Enjoy.
Knafeh
Queen Zubaida set many trends in dressing, perfumes, art and architecture
of Baghdad and Iraq. She introduced many dishes which became worldfamous. Here is one of her recipes for you to try out.
Serving size: 8
Cooking time: 20 minutes
Ingredients:
To make the Sugar Syrup
Sugar 2 cups
Lemon Juice 1½ teaspoon
Rose Water 2 tablespoons
Orange Blossom Water 2 tablespoons
Water 1 cup
To make the Knafeh
Shredded Phyllo Dough ½ lb.
Butter melted ¼ cup
Orange/Red Food Coloring 1 teaspoon (optional)
Akawi Cheese mozzarella 1 lb.
Pistachios crushed ¼ cup
Instructions:
To make the Sugar Syrup
In a pot, add lemon juice, sugar, orange blossom water, rose water, and
simple water. Stir them well.
Put the pot on high heat. Then, bring the ingredients to a boil. Dissolve the
sugar completely while stirring continuously.
Remove the pot from heat. Allow it to cool completely.
To make the Knafah
Preheat the oven to about 375 F.
Use your fingers to spread your phyllo dough. Put this dough in a big bowl.
Melt the butter. Then add the coloring into the butter. Mix well.
Put the butter on the phyllo. Mix it using your hands and tear the phyllo.
You need to saturate its topping in the butter.
Use the dough topping of phyllo to cover the lowest part of the tray.
Put the cheese on top of your dough in the tray.
Bake for at least 20 minutes or until the cheese melts.
Remove it from the oven. Flip this tray into a larger plate or tray.
Put the sugar syrup on the knafeh. Sprinkle the pistachio nuts over it.
Serve the knafeh immediately.
Cheese Fatayer
Cheese Fatayer is the staple food of the common household of Baghdad.
The bakers of the city are always busy preparing the orders for the rich city
dwellers. We have brought you the most flavorful fatayer recipe to try with
Tabouleh and any type of kebab.
Serving size: 2
Cooking time: 20 minutes
Ingredients:
All-purpose flour 2 ½ cups
Instant yeast 1 packet
Salt ½ teaspoon
Mozzarella cheese shredded ½ cup
Whole milk lukewarm ¾ cup
Olive oil 1/3 cup
Feta cheese ½ cup
Onion seeds 2 teaspoons
Beaten egg 1
Sugar 1 tablespoon
Finely chopped parsley 4 tablespoons
Instructions:
Add the salt, yeast, and sugar to the lukewarm milk.
Pour this milk into the all-purpose flour and mix well.
Add the olive oil into it. Knead it for some minutes.
Cover it using a muslin cloth (damp). Let the dough rest for about 10
minutes.
Make small balls from the dough after about 10 minutes.
Meanwhile, take cold water and soak feta cheese in it. Soak it for 10
minutes while changing this water two times in between.
Crumble this feta cheese into a bowl.
Add the onion seeds, parsley, egg, and mozzarella cheese to the bowl and
mix well.
Roll the balls into an oval form. Put one tablespoon of cheese mixture into
the middle of each oval.
Take both sides of their edges and fold them like a boat shape.
Bake them in a preheated oven for 20 minutes at 356 F.
Serve hot.
Main Course
Shish Tawook (Chicken Kabob)
Hunting for fun was a popular game in Baghdad according to the famous
Arabian Nights. The meat of the hunted animals was roasted in the form of
kebobs. King Haroon Rashid used to enjoy Shish Tawook or a kebob made
with venison. Here is an easier version of the exclusive royal version for
you since arranging venison may be a little tricky for you.
Serving size: 4
Cooking time: 15 minutes
Ingredients:
Olive oil 3 tablespoons
Paprika ½ teaspoon
Garlic powder ½ teaspoon
Onion powder ½ teaspoon
Cayenne pepper to taste
Chili powder 1 teaspoon
Juiced lime 1
Ground black pepper to taste
Salt to taste
Red wine vinegar 1 ½ tablespoons
Chicken breast skinless and boneless 1 lb. (cut in 1 ½inch
pieces)
Skewers
Instructions:
Take a bowl and add lime juice, vinegar, and olive oil.
Season the ingredients of the bowl with the black pepper, salt, cayenne
pepper, garlic powder, onion powder, paprika, and chili powder.
Put the chicken in the baking dish along with the sauce. Stir the sauce to
coat.
Cover the dish. Then, put it in the refrigerator for an hour to marinate.
On medium heat, preheat the outdoor grill.
Put the chicken on the skewers. Discard the margination.
Oil the grate of the grill lightly.
Grill the skewers until the juices of this chicken run clear. It will take about
15 minutes.
Serve hot.
Samak fish kabab
On one of the islands in the story, people used to eat raw fish. However,
they started to cook their food to please their new princess. The part of the
tale inspired us so much that we ended up making this exclusive recipe.
Give a try to the tasty fish recipe and see if your imagination takes you to
faraway lands.
Serving size: 6
Cooking time: 15 minutes
Ingredients:
Cornstarch 1 tablespoon
Crushed garlic cloves 2
Minced fresh ginger 3 tablespoons
Pineapple juice 2 cups
White vinegar 1 ½ tablespoons
Fresh pineapple cut in large chunks 4 cups
Raw firm fish like salmon or tuna 1 ¼ lb. (cut into chunks)
White vinegar 1 ½ tablespoons
Large red onion 1 (cut in wedges)
Light soy sauce 2 tablespoons
Instructions:
Dissolve the cornstarch in the pineapple juice in a saucepan.
Add the ginger, garlic, vinegar, and soy sauce to it.
Simmer for 7 minutes until it gets thick. Let it cool.
Add the pineapple and fish into the sauce. Marinate these for half an hour in
the refrigerator.
Thread the onion, pineapple, and fish on the skewers.
Place the skewers on a hot grill.
Grill it until the fish is done.
Serve these gingery fish kababs with rice.
Classic Roast Leg of Lamb
The most famous dish we find in every feast, dinner and lunch in the
legendary tale is roasted meat. This recipe contains many ingredients that
seem royal and give a regal taste to the delicacy. Make it for a weekend
dinner and see how people become a fan of your culinary skills.
Serving size: 12
Cooking time: 1 hour 45 minutes
Ingredients:
Fresh rosemary 2 tablespoons
Ground black pepper to taste
Leg of lamb 5 lb.
Salt to taste
Sliced garlic cloves 4
Instructions:
Preheat the oven to around 350 F.
Make slits in the leg of the lamb at every 4 inches. These slits should be
deep so that the garlic slices can be pushed down into it.
Sprinkle pepper and salt on the top of the lamb. Put several sprigs of the
rosemary on top and under the lamb leg.
Place the leg on the roasting pan.
Roast the lamb in the preheated oven for 2 hours and until the lamb is
cooked well.
Let it rest for 10 minutes.
Serve hot
The Arabian Nights Special Lemongrass
Lamb Chops
Cooked whole lamb used to be elite food in all the stories we read in
Arabian Nights. Arranging a whole lamb and cooking it is a bit too difficult
in your modern kitchen. So, we have made its recipe easier by using lamb
chops only. Cook and savor it with your loved ones.
Serving size: 4
Cooking time: 15 minutes
Ingredients:
Chopped garlic cloves 2
Chopped cilantro leaves 3 tablespoons
Sea salt 1 teaspoon
Chopped fresh mint 3 tablespoons
Extra-virgin olive oil ¼ cup
Freshly ground pepper
Freshly ground pepper to taste
Peeled and chopped fresh ginger ½ inch
Lamb rib chops ( ½-inch thick) 12
Peeled and sliced crosswise stalks lemongrass 2
Lemon wedges 4
Instructions:
First, prepare the marinade. Place the salt, ginger, lemongrass, and garlic in
the mortar. Grind these ingredients to a paste using the pestle.
Add the mint and cilantro and grind for a minute. Stir them in the oil.
Take a shallow dish and place the lamb chops in it. Pour the marinade over
it. Turn the lamb to coating it well. Let the lamb stand for an hour.
On high heat, preheat the grill. Place the lamb on it and cook. Every two
minutes, turn it to cook well. It will take 4 to 5 minutes.
Transfer the lamb to the plate. Then, cover it for 10 minutes to keep it
warm.
Evenly divide the lamb into four plates. Pour the juices on the lamb if left.
Season the lamb with pepper. Put a lemon wedge on each plate to garnish.
Grilled Mustard Covered Rack of Lamb
As we have told earlier, roasted lambs and camels were part of the routine
dinners in Baghdad. However, you need to compromise a little on the size
of the dish if you want to relish the exclusive delicacies. Try this recipe to
find out how a routine dinner at the riverside of Dajjal would be.
Serving size: 8
Cooking time: 30 minutes
Ingredients:
Ground pepper ½ teaspoon
Apple cider vinegar ½ teaspoon
Frenched lamb 2 racks
Minced garlic cloves 2
Good quality Dijon mustard 4 tablespoons
Kosher salt 1 teaspoon
Fresh rosemary chopped 1 teaspoon
Brown sugar 1 teaspoon
Instructions:
Oil and preheat the grill.
Take a bowl and whisk the apple cider vinegar, garlic, brown sugar,
rosemary, pepper, salt, and mustard in it.
Rub this mixture on lamb racks liberally. Allow the racks of lamb to rest for
15 to 20 minutes before starting to grill.
Put the lamb with the fat side facing down on the grill. Let the marks of the
grill appear. It will take about 6 minutes.
Transfer the lamb to the grill’s cooler side and cook with the lid down for
20 more minutes.
Remove the lamb from the grill and wrap it in foil. Let it rest for 10
minutes. Then slice in a direction along the ribs.
Serve this lamb rack with the roasted veggies.
Kabsa
Being the head of the Haram, Queen, Zubaida used to take special care of
the royal kitchen. Kabsa is a special dish she developed especially for her
beloved husband, King Haroon Rashid. Full of spices and deliciously rich
in flavor, this dish is going to make you a popular cook.
Serving size: 8
Cooking time: 1 hour 30 minutes
Ingredients:
Ground cardamom ¼ teaspoon
Saffron ½ teaspoon
Ground allspice ½ teaspoon
Butter ¼ cup
Finely chopped onion 1
Dried whole lime powder ½ teaspoon
Ground white pepper ¼ teaspoon
Tomato puree ¼ cup
Whole cloves 2
Minced garlic cloves 6
Ground cinnamon ½ teaspoon
Peeled and grated carrots 3
Ground nutmeg 1 pinch
Ground cumin 1 pinch
Ground coriander 1 pinch
Hot water 3 ¼ cups
Undrained diced tomatoes 1 can
Unrinsed basmati rice 2 ¼ cups
Raisins ¼ cup
Cube chicken bouillon 1
Toasted slivered almonds ¼ cup
Freshly ground black pepper to taste
Salt to taste
Whole chicken 1 lb. (cut into 8 pieces)
Instructions:
Mix the lime powder, white pepper, allspice, cinnamon, cardamom, and
saffron in a bowl. Set aside this spice mix.
Next, in a pot, melt butter on medium heat.
Add the onion and garlic, and cook until the onion becomes soft and
translucent.
Add the pieces of chicken and on medium heat and cook for 10 minutes and
until they become light brown. Add in it the puree of tomato.
Add the tomatoes in the can and their juice. Then, add Kabsa spice
ingredients along with the black pepper, salt, coriander, cumin, nutmeg,
chole cloves, and the carrots. Cook for at least three minutes, then pour the
water into it. Then add the cube of chicken bouillon.
Next, bring this sauce to the boil and then let it simmer and meanwhile
cover the saucepot.
Simmer it until juices of chicken run clear. It will take around 30 minutes.
Add the rice slowly. Cover and simmer until rice becomes almost dry and
tender in around 25 minutes.
Then, add the raisins into it. Cover and give added 10 minutes to it for
cooking.
Put the rice on a big serving platter. Arrange the pieces of chicken on the
top.
Sprinkle the almonds too over the Kabsa. Serve hot.
Sheikh El Mihshi
There are many Indian princesses in the tale, and all of them have a special
taste for vegetables. This taste inspired us to tweak the famous recipe of
Sheikh El Mihshi. Make it for lunch in summer afternoons and feel how the
magic of the East works on you.
Serving size: 2
Cooking time: 45 minutes
Ingredients:
For the Eggplants dish
Small eggplant 1 lb.
Minced meat ½ lb.
Salt for filling ¼ teaspoon
cinnamon ¼ teaspoon
Black pepper 1/8 teaspoon
Allspice ¼ teaspoon
Tomato paste for filling ½ teaspoon
Large onion diced ½
Lebanese 7 spices mix 1/8 teaspoon
Vegetable oil 1 tablespoon
Pine nuts 0.1 lb.
For the Sauce
Peeled and diced tomatoes 1 lb.
Hot water ½ cup
Salt 1/4 teaspoon
Cinnamon to taste
Allspice to taste
Lemon juiced ¼
Tomato paste ½ teaspoon
Instructions:
For the Sauce
Cook the tomatoes in water and the tomato paste for 20 minutes on
medium-high heat.
Puree this mix. Season it with some cinnamon, allspice, and salt to taste.
Put the lemon juice in it and set it aside.
For the Eggplants
Cut a pocket in the eggplants using a sharp knife and deeply fry them.
Sauté the onions in a big saucepan until they become soft.
Add the minced meat. Cook it thoroughly.
Season it with the spices listed in the eggplant dish list above.
Add the pine nuts and tomato paste and cook for around 5 minutes.
Generously stuff the fried eggplants.
Spread the prepared sauce in the baking tray. Add the eggplants to it.
On medium heat, cook the eggplants for 20 minutes.
Use the chopped parsley for garnishing.
Mejadra Rice
Aladdin, one of the most famous characters of the story, was born and
raised in China. He relishes his Chinese roots by eating rice in many
luxurious forms. This is because rice is the most popular food in China.
Here is our guess of what he would have liked the most for rice.
Serving size: 8
Cooking time: 50 minutes
Ingredients:
Chopped large onion 1
Olive oil ¼ cup
Green lentils 1 cup
Brown rice 1 cup
Salt 1 teaspoon
Ground black pepper ½ teaspoon
Ground cumin 1 teaspoon
Chopped fresh ginger root 1 teaspoon
Chopped garlic cloves 3
Ground cinnamon ½ teaspoon
Water 2 ½ cups
Instructions:
In the pot, heat the olive oil on medium heat.
Cook the garlic and onion for 5 minutes or until they become soft.
Add the ginger and cook for a minute until it gets fragrant.
Add the brown rice. Stir the rice in oil to coat well.
Stir the cinnamon, black pepper, salt, cumin, and lentils in the mixture of
rice.
Cover the pot with water and stir on the low heat.
Cook until the lentils become tender. It will take around 45 minutes.
Serve hot.
Dawood Basha
The Sri Lankan merchant whose ship was wrecked in a storm ate only rice
in one of the tales. Later, when he married a local girl, he also developed his
taste in food. This recipe perfectly describes his food evolution. It is
probably the tastiest blend of rice, meat and vegetables. 
Serving size: 4
Cooking time: 30 minutes
Ingredients:
For meatballs:
Diced or grated onion ½
Cinnamon ½ teaspoon
Salt 1 teaspoon
Black pepper powder ½ teaspoon
Chopped parsley a handful
Minced garlic cloves 3
Allspice or mixed spice 1 ½ teaspoons
Ground beef 1 lb.
Finely chopped green chili pepper 1
For stew:
Diced onion 1
Olive oil 1 tablespoon
Diced tomatoes 3
Sliced garlic cloves 6
Chopped potatoes 2
Tomato paste 3 tablespoons
Vegetable oil for frying 1 tablespoon
Water 2 cups
Pomegranate molasses 1 tablespoon
Mixed spices 1 big pinch
Pepper and salt to taste
Bouillon stock cube 1
Instructions:
Mix all the ingredients in the meatballs list using your hands.
Make balls of equal size in medium size.
Put in the refrigerator for around 10 minutes.
On medium heat, heat vegetable oil and put the meatballs in it. Cook the
meatballs for 4-5 minutes or until brown. Remove the balls from the pan.
Fry the chunks of tomato. Remove the chunks after a minute.
Add the olive oil to a pan. Sauté onion in it for 5 minutes.
Add tomato paste and garlic. Simmer it for 5 minutes.
Mix the water and stock cube along with water in the pan.
Add salt, pepper, spices, and molasses into it.
Add meatballs. Cook for 15 minutes or until everything is well cooked.
Serve it with vermicelli or plain rice. Garnish with the parsley.
Desserts
Mahalabia
Unlike modern cuisine, desserts were used with every meal in the
households of Baghdad as per Arabian Nights. The cooks used to prepare
desserts as a snack and had to make some desserts ready every time in the
house. Here is a quick recipe for this yummy Arab dessert. Prepare it and
keep it in the refrigerator to curb your sweet cravings.
Serving size: 4
Cooking time: 15 minutes
Ingredients:
Heavy cream 1 cup
Vanilla sugar 2 teaspoons
Cornstarch 4 teaspoons or as needed
White sugar 3 tablespoons
Milk 2 cups
Ground cinnamon ¼ teaspoon or to taste
Instructions:
Combine the cornstarch, vanilla sugar, sugar, cream, and milk in the
saucepan. Whisk these ingredients until combined well.
On medium heat, bring them to a boil. Cook until it gets thick while stirring
constantly. The mixture should coat a spoon’s back. It will take about 15
minutes.
Remove from the heat.
Pour this pudding into four dessert bowls. Allow it to cool for 30 minutes.
Refrigerate the pudding for an hour until it gets chilled well.
Sprinkle the pudding with the cinnamon before serving.
Umm Ali
There was an old woman on the main gate of the Jamia Mosque of Baghdad
who sold a special sweet dish. We assume that this recipe is very near to the
dish she used to sell the days. You must try it in order to decide if it makes
you crave the ancient, peaceful and happy city of Baghdad.
Serving size: 8
Cooking time: 30 minutes
Ingredients:
Milk 5 cups
White sugar 1 cup
Pine nuts ¼ cup
Raisins ¼ cup
Slivered almonds ¼ cup
Flaked and sweetened coconut ¼ cup
pistachio nuts, chopped, ¼ cup
Vanilla extract 1 teaspoon
Thawed frozen puff pastry 1 package
Instructions:
Preheat the oven to about 400 F.
Put the puff pastry sheets on the baking sheet.
Bake in preheated oven for 15 minutes until it becomes golden brown in
color.
Make pieces of the puff pastry in a big bowl.
Add the coconut, pistachios, pine nuts, almonds, and raisins. Toss them to
evenly distribute.
Put them in a baking dish. Spread evenly.
Pour milk into the saucepan. Add vanilla and sugar.
Do not boil, but it should be hot.
Pour this mixture into a baking dish.
Bake in preheated oven for 15 minutes.
Broil the top for 2 minutes. Remove and let it stand for 10 minutes.
Serve warm.
Basbousa
Every celebration and religious ceremony in Baghdad used to end with the
giveaway of sweets. This easy to store and extremely tasty dessert recipe
fits the criteria of the majestic sweets. Make it and feel yourself a part of the
mysterious events.
Serving size: 12
Cooking time: 30 minutes
Ingredients:
Plain yogurt 1 cup
Vegetable oil ½ cup
White sugar ½ cup
Flaked coconut 3 tablespoons
Baking powder 1 tablespoon
Semolina flour 1 ½ cups
Water 1 ½ cups
White sugar 1 ¾ cups
Rosewater 2 tablespoons
Almonds (split in half) 6
Instructions:
Mix the baking powder, coconut, oil, yogurt, sugar, and semolina flour in a
bowl. Set it aside.
On medium heat, add rosewater, 1 ¾ cup of sugar, and water in a saucepan.
Boil it for 4 minutes.
Remove from the heat. Set aside to bring it to room temperature.
 Preheat the oven to about 350 F.
Put the batter of semolina in a baking pan’s bottom.
Make slices in square shape and put one almond on each piece.
Bake in a preheated oven for about 20 minutes.
After baking, broil it until the top gets golden in color.
Remove it from the oven. Pour syrup on the squares.
Serve warm.
Scheherazade’s Special Aish el-Saraya
When the king started liking Scheherazade after listening to her stories
every night, she started claiming her royal status. She used to order special
dishes for the royal couple, and desserts were the most important part of the
meals. We tried to give this famous Arab recipe an exclusive twist.
Serving size: 4
Cooking time: 5-6 hours
Ingredients:
Lemon juice 1 tablespoon
Sugar 1 cup
Rosewater 1 tablespoon
For the custard
Milk 2 cups
Bread rusk small 30
Corn starch/ cornflour 5 tablespoons
Rosewater 2 tablespoons
Chopped pistachios for garnishing
Sweetened condensed milk 1 ¾ cups
Whipping cream 1 ¾ cups
Instructions:
Arrange the toasted rusks in a dish.
Put the lemon juice, sugar, rosewater, and water in a pan to make syrup. Put
it on medium heat.
Remove from heat as soon as sugar melts. Allow it to cool.
Put half of the syrup on rusks. Let the rusks soak.
Make the second layer of the rusks. Pour the remaining syrup on them.
In the cold milk, mix the cornflour custard.
Pour cornflour mixture, condensed milk, cream, and the remaining milk in a
pan over medium heat.
Keep stirring continuously to keep it thick and smooth.
Add the rosewater. Mix it well until the mixture becomes thick but has a
pouring consistency.
Pour the custard on the rusks. Sprinkle pistachios over it and put in the
refrigerator for 5 hours.
Serve chilled.
Halwat el Jibn
When the princess in the story of Hunchback got fainted, her husband
prepared a special dish called “Halwa” for her. We are sure that his recipe
for Halwa is better than that. Decide it after trying.
Serving size: 15
Cooking time: 25 minutes
Ingredients:
Water 1 ½ cups
Semolina 1 cup
White sugar 1 cup
Shredded mozzarella 2 cups
Rosewater 2 tablespoons
Table cream 2 cups
Instructions:
Add sugar and water to a saucepan. Then, put on medium heat. Simmer it
until sugar is dissolved. Add the rosewater. Stir gently.
Add the semolina. Stir until well combined.
Add the mozzarella cheese. Stir it constantly until it takes dough form.
Keep it stirring until this dough-like mixture holds together.
Remove from the heat. Then, let it cool for 10 minutes.
Knead the dough until smooth and even.
Roll half of the dough on a plastic wrap and give it a rectangle shape.
Cut the rough edges.
Take the table cream and extend or spread it on the log shape dough. The
thickness of cream needs to be 1/2”.
Bring it towards cream and roll it on the cream so that dough overlaps with
it.
Finish all the dough by slicing it towards the end using a knife.
All the filled log roles need to be further sliced in 1 ½” size.
Top them with sugar syrup and crushed pistachio. Enjoy.
Layali Lubnan
Roses and milk are probably the most appetizing ingredients in a dessert,
right? This dish must be somewhere there in the favorite list of the
numerous princes and princesses of Arabian Nights. Our recipe for the dish
is simple and easy to make.
Serving size: 4
Cooking time: 2 hours
Ingredients:
Full-fat milk 4 ¾ cups
Sugar 2 teaspoons
Semolina 1 cup
Caster sugar ½ cup
Vanilla extract ½ teaspoon
Rose petals 15 (optional)
For Astha cream:
Full-fat milk 2 cups
Sugar 2 tablespoons
Rosewater 2 teaspoons
Corn starch ½ cup
cottage cheese ½ cup
Pistachio for garnishing
For sugar syrup:
Sugar 1 cup
Rosewater ½ teaspoon
Lemon juice 1 tablespoon
Water 2 cups
Instructions:
Mix the rosewater, semolina, sugar, and milk in a pan over medium heat.
While mixing, add the vanilla extract until it comes to a boil.
Remove from heat, transfer into a butter greased mold and keep for two
hours in the refrigerator to set.
Mix the rosewater, sugar, cornstarch, and milk in a different pan. Stir until
the sugar is dissolved.
Turn on the heat and stir until it is thickened.
Remove from heat and add the cottage cheese. Stir it well.
Pour it on the semolina pudding’s top. Refrigerate for 3 hours to set.
Mix lemon juice, sugar, rose water, and water in a pan to make sugar syrup.
Cook until all sugar is dissolved and this syrup gets thick. Set it aside.
Garnish it with pistachios. Pour sugar syrup on its top. Serve.
