ETHIOPIAN
CUISINE A COMPLETE
COOKBOOK
OF COLORFUL,
EXOTIC DISHES
ANGEL BURNS
Ethiopian Cuisine
A Complete Cookbook of Colorful, Exotic Dishes
By
Angel Burns
© 2019 Angel Burns, All Rights Reserved.
License Notices
This book or parts thereof might not be reproduced in any format for
personal or commercial use without the written permission of the author.
Possession and distribution of this book by any means without said
permission is prohibited by law.
All content is for entertainment purposes and the author accepts no
responsibility for any damages, commercially or personally, caused by
following the content.
Get Your Daily Deals Here!
Free books on me! Subscribe now to receive free and discounted books
directly to your email. This means you will always have choices of your
next book from the comfort of your own home and a reminder email will
pop up a few days beforehand, so you never miss out! Every day, free
books will make their way into your inbox and all you need to do is choose
what you want.
What could be better than that?
Fill out the box below to get started on this amazing offer and start
receiving your daily deals right away!
https://angel-burns.gr8.com
Table of Contents
Delicious Ethiopian Food Recipes
Chapter I - Ethiopian Breakfast Recipes
Recipe 1: Genfo (Porridge)
Recipe 2: Firfir & Egg
Chapter II - Ethiopian Lunches, Dinners and Sides
Recipe 3: Zigni Hot Curry
Recipe 4: Ethiopian Rice Pilaf
Recipe 5: African Chicken & Sauce
Recipe 6: Chicken Stew (Doro Wat)
Recipe 7: Ginger-Garlic Vegetables
Recipe 8: Ethiopian Cauliflower
Recipe 9: Fossolia
Recipe 10: Shiro Wat
Recipe 11: Cucumber & Tomato Salad
Recipe 12: Ethiopian Cabbage
Recipe 13: Injera (Ethiopian Flat Bread)
Recipe 14: Mild Beef Stew
Recipe 15: Ground Nut Stew
Recipe 16: Gomen
Recipe 17: Yams & Lentils
Recipe 18: Spiced Steak
Recipe 19: Turmeric Carrots & Cabbage
Recipe 20: Ingudai Tibs (Sautéed Mushrooms)
Recipe 21: Timatim Salad
Recipe 22: Sautéed Lamb
Recipe 23: Berbere Jackfruit Tacos
Recipe 24: Potatoes & Cabbage
Recipe 25: Buticha
Recipe 26: Berbere Lentils
Recipe 27: Kitfo (Steak tartar)
Chapter III - Ethiopian Desserts
Recipe 28: Ethiopian Fruit Salad
Recipe 29: Ethiopian Baklava
Recipe 30: Sanbusa Turnovers
About the Author
Author's Afterthoughts
Delicious Ethiopian Food Recipes
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Chapter I - Ethiopian Breakfast
Recipes
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Recipe 1: Genfo (Porridge)
Genfo means “thick porridge” in the ancient African language of Amharic.
Most people make it using barley flour, wheat flour or corn meal. Each type
offers its own great taste.
Yield: 3-4 Servings
Preparation Time: 50 minutes
Ingredient List:
1 teaspoon of berbere spice mixture
2 tablespoons Kibbeh (seasoned, clarified butter, also called
kibe)
2 cups flour, all-purpose
Water, purified
Salt, coarse
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Add 3 cups water and 1 teaspoon salt to medium sized pot. Bring to boil
over med-high.
2. When water is boiling, add flour slowly. Stir with wooden spoon. You
will notice that the flour will cause it to be quite thick, and difficult to stir.
3. Continue stirring to remove lumps. Mix hard. Add extra water if needed.
4. Remove water and flour, now a porridge called genfo, from heat. Add the
melted butter to a bowl. Scoop genfo in a ball into bowl.
5. In center of ball of genfo, create a well with a spoon. Add berbere and
melted kibe butter while it is still hot. Mix well. Serve.
Recipe 2: Firfir & Egg
This firfir dish is pretty easy to bring together. If you make your sauce the
previous night, you can rewarm it when you’re ready to eat, and throw the
bread in. It’s a hearty, spicy, delicious breakfast treat.
Yield: 2-4 Servings
Preparation Time: 35 minutes
Ingredient List:
4 minced garlic cloves
1 tablespoon of oil, olive
½ minced small onion, yellow
2 eggs, large
2 cups of torn baguettes
1 & ½ cups of stock, vegetable
1 tablespoon of tomato paste
1 & ½ tablespoons of berbere spice (African spice mixture), +
more as desired
½ teaspoons of salt, kosher
Optional:
Sliced cucumbers, to serve
2 tablespoons of yogurt, plain, to serve
¾ cup of chick peas
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Sauté salt and onion in large sized fry pan over med. heat until onion
becomes soft and translucent. Add tomato paste, garlic and berbere spices.
Stir together. Add in beans and water and stir again.
2. Increase the heat up to high and bring to boil. Then lower the heat to hold
the simmer. Leave uncovered and cook for 10 minutes or so. The sauce
should be reduced by 1/3.
3. Taste for seasoning and add some more berbere, as desired.
4. Keep sauce warmed on low flame while cooking eggs. Cook them the
way you prefer. Sunny side up works well, since the runny yolk goes great
with spicy sauce.
5. When eggs are nearly done, stir bread into sauce. Spoon it into two
individual bowls. Top bowls with one egg each. Dollop yogurt on top of
bowls. Serve promptly.
Chapter II - Ethiopian Lunches,
Dinners and Sides
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Recipe 3: Zigni Hot Curry
This dish is very traditional and very hot. If you usually enjoy hot curry
foods, you will love this one. Berbere spices are useful here and can also be
used in tomato sauces and in BBQs.
Yield: 4-6 Servings
Preparation Time: 55 minutes
Ingredient List:
½ cup of red wine, dry
1 tablespoon of tomato paste
2 bouillon cubes, beef
2 x 14-oz. cans of tomatoes, plum, with their liquid
¼ cup of oil, vegetable
2 pounds of cubed stewing beef
4 crushed cloves of garlic
2 chopped onions, large
Berbere spice mixture, as desired
Kosher salt
Black pepper, ground
Optional: fresh cilantro and lemon juice
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Cook beef over high heat till it browns. Add onion, garlic and 3
tablespoons of berbere spice mixture. Do not allow anything to burn.
2. Deglaze pan with wine. Add tomatoes and liquid, tomato paste and stock
cubes. Allow to slowly simmer until strew is thickened and beef is tender.
This will take between ½ hour and 2 hours, depending on meat thickness,
etc.
3. Add lemon, kosher salt and ground pepper, as desired. Garnish using
cilantro. Serve on Ethiopian flat bread, potatoes or rice.
Recipe 4: Ethiopian Rice Pilaf
This is, once again, a dish that is made from berbere spices and their
authentic flavor. Berbere is in many ways similar to garam masala, an
Indian spice mixture. It makes this rice pilaf dish quite original in flavor.
Yield: 4-5 Servings
Preparation Time: 40 minutes
Ingredient List:
4 cups of wild rice blend, cooked
¾ teaspoons of berbere spice blend
2 peeled, minced garlic cloves
2 diced, rinsed leeks, medium
1 orange, zest only
2 cups of drained, rinsed Ethiopian adzuki beans, (or red or
kidney beans), cooked
4 sliced green onions, green and white parts
Sea salt & ground pepper, as desired
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Place leeks in large sized sauce pan. Sauté on med. heat for about 10
minutes. Add 1-2 tablespoons of water at a time. This ensures that leeks
won’t stick to pan.
2. Add garlic. Cook for a couple minutes. Add berbere spices. Cook for ½
minute.
3. Add orange zest, rice and beans. Stir. Season using sea salt & ground
pepper. Cook mixture until it has heated all the way through.
4. Garnish using green onions. Serve.
Recipe 5: African Chicken & Sauce
You can use whatever parts of chicken you prefer in this saucy dish.
Boneless, skinless breasts work well. This flavorful stew is just one of the
many dishes that benefit from the Ethiopian spice mixture of berbere.
Yield: 4-5 Servings
Preparation Time: 1 & 1/2 hour
Ingredient List:
1 x 14 & ½-oz. can of broth, chicken
½ cup of red wine, dry
2 pounds of chicken breast, boneless
1 & ½ cups of onions, chopped
1 x 6-oz. can of tomato paste
Berbere spice mix
4 wedges of lemon
½ teaspoons of cardamom, ground
1 teaspoon of oil, olive
½ teaspoons of nutmeg, ground
1 tablespoon each of minced ginger, butter and minced garlic
¾ teaspoons of salt, coarse
1 fresh lemon, juice and wedges
2 tablespoons of cilantro, fresh
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Place the chicken in shallow dish and drizzle with the lemon juice.
Sprinkle with ½ teaspoons of salt. Cover. Marinate in fridge for 1/2 hour.
2. Heat large sized pot on med. heat. Add the olive oil, garlic and onion. Stir
while cooking for five minutes. Don’t allow them to brown.
3. Add 2 teaspoons of berbere spice mix, ¼ teaspoons of salt, cardamom,
ginger and nutmeg. Cook for a minute.
4. Add tomato paste, wine and broth. Stir till blended well. 
5. Add the chicken mixture and bring it to boil.
6. Cover pot. Lower heat. Simmer for 45 minutes until the chicken becomes
tender. Turn the chicken once in a while.
7. Add cilantro and stir. Serve with the lemon wedges. 
Recipe 6: Chicken Stew (Doro Wat)
The flavor of this dish will wow you and your family. It’s a national dish of
Ethiopia and it comes together easily and quickly. When the chicken is
simmering, the aroma is divine. And it tastes just as good when you heat up
the leftovers a couple days after the initial meal.
Yield: 5-6 Servings
Preparation Time: 1 hour & 10 minutes
Ingredient List:
1 & ½ cups of stock, chicken
¼ cup of berbere spice mix
1” of peeled, chopped ginger, fresh
4 minced cloves of garlic
2 sliced onions, large
2 tablespoons of butter, unsalted
3 tablespoons of oil, vegetable
3 pounds of chicken, cut in pieces, rinsed off, patted dry
2 tablespoons of lime juice, fresh
To Garnish: 4 eggs, hard-boiled
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Heat the oil in large sized pan. Brown chicken pieces. When all are
lightly browned, remove them.
2. In same pan, add garlic, ginger, onion and butter. Cook till they are
brown.
3. Add berbere spice mixture. Sauté mixture on low until browned.
4. Add lime juice and chicken stock. Simmer for three to four minutes.
5. Return chicken pieces to pan. Cover it. Slowly simmer for 1/2 hour. Turn
chicken pieces occasionally.
6. Transfer stew to platter. Use eggs to garnish. Serve with bread.
Recipe 7: Ginger-Garlic Vegetables
This tasty dish is often served during the church’s season of Lent. In those
cases, it is served as a main course. But you can serve it anytime you like,
as a side dish.
Yield: 6 Servings
Preparation Time: 40 minutes
Ingredient List:
6 trimmed, chopped scallions, large
3 peeled carrots, large
6 peeled potatoes, small
2 washed, seeded, chopped chili peppers, hot, whole
1 seeded, sliced green pepper, large
2 chopped onions, medium
¼ cup of oil, vegetable
½ pound of trimmed, chopped green beans, fresh
2 teaspoons of chopped ginger
1 tablespoon of chopped garlic
1 teaspoon of sea salt, coarse
½ teaspoons of pepper, WHITE
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Slice potatoes into round slices. Drop them into cold water so they won’t
become discolored.
2. Cut carrots into quarters lengthways. Then cut crossways into pieces of
2” each.
3. Drop potatoes into the boiling water. Add beans and carrots. Boil for
three to five minutes. Drain. Run them under cold water to keep them from
cooking more. Set aside so they can completely drain.
4. Heat oil in large pan. Add chilies, onions and green pepper. Cook for five
minutes or so. Veggies should not be brown but should be soft.
5. Add salt, pepper, ginger and garlic. Stir for one to two minutes. Add
scallions and reserved veggies. Mix well until all ingredients have become
coated with oil.
6. Reduce heat to low. Cover pan partially. Cook for eight to 10 minutes.
Veggies should be tender but crisp. Ladle into plates or bowls. Serve.
Recipe 8: Ethiopian Cauliflower
The wonderful interplay between sweet and savory spices toys with and
cuts through the many rich flavors of this traditional African meal. It’s also
gluten-free and vegan, so it will appeal to many of your dinner guests.
Yield: 2-3 Servings
Preparation Time: 35 minutes
Ingredient List:
3 cups of cauliflower, cooked
2 tablespoons of tomato paste
3 chopped tomatoes, medium
1 tablespoon of chopped ginger
4 tablespoons of ghee (clarified butter)
2 chopped onions, medium
3 chopped garlic cloves
2 teaspoons of berbere spice mixture
3 cloves garlic, chopped
1 bunch of basil
Sea salt, as desired
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Place ghee and onions in large sized pot over med. heat. Cook till the
onions are golden in color.
2. Add the tomatoes, ginger and tomato paste and cook for an additional
five minutes.
3. Mash the cauliflower.
4. After tomatoes are dissolved into sauce, add garlic, cauliflower mash and
berbere spice mix. Combine well. Simmer for about five minutes.
5. Add ¾ basil and salt, as desired. Simmer for two to three more minutes.
Garnish with the rest of the basil. Ladle into individual bowls. Serve.
Recipe 9: Fossolia
This is a delicious dish made from green beans. As you’ll find with many
dishes in Ethiopia, there are many ways it can be prepared. Some have a
strong flavor of tomato, while others are more ginger-y or garlicky.
Yield: 3-4 Servings
Preparation Time: 45 minutes
Ingredient List:
2 or 3 chopped tomatoes, medium
3 sliced carrots
4 cups of green beans with ends removed, then halved
½ x 6-ounce can of tomato paste
1/3 cup of oil, canola
2 chopped onions
As desired: minced garlic and ginger
As desired: salt, coarse
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Cook onions in pan over med. heat for five to eight minutes. Onions
should start softening and become translucent.
2. Add oil. Continue to cook for a few more minutes. Add tomato paste and
stir it in. Allow a few minutes for ingredients to simmer and blend.
3. Add carrots and green beans. Combine by stirring. Cover. Cook over
med. heat for 10 to 15 more minutes.
4. Add salt, ginger, tomato and garlic. Simmer until vegetables are all
tender. Remove to plates or bowls and serve.
Recipe 10: Shiro Wat
Shiro flour is made with ground legumes and is the heart of this recipe. The
flour can be made with split peas, chick peas or fava beans. Most chefs at
Ethiopian restaurants use chick peas, but you can use whatever your family
prefers from these choices.
Yield: 1-2 Servings
Preparation Time: 25 minutes
Ingredient List:
2 to 3 cups of water, filtered
2 & ½ tablespoons of tomato paste
½ cup of oil + extra
1 chopped onion, medium
Minced garlic and ginger, as desired
¾ cup of mit’in shiro (Hot Ethiopian Seasoning)
Salt, kosher, as desired
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Cook onions in a dry, deep, large skillet. Stir frequently for a few minutes
over med-high. When onions are soft, add oil. After the oil has been heated,
add tomato paste. Combine well.
2. Wait several minutes. Then add 2 cups of filtered water. Bring to boil.
Slowly add shiro and briskly stir with whisk, removing lumps. Add
additional oil or water as it is needed for achieving a good consistency.
3. Add the garlic and ginger. Stir. Add in salt, as desired. When shiro is
ready, it becomes thick and pops. Be aware, or it could become messy. Oil
will separate and will rise to top.
4. Stir a final few times. Serve.
Recipe 11: Cucumber & Tomato Salad
This is a refreshing and simple recipe. Don’t let the jalapeño scare you – it
will add to the overall flavor without being too hot. The salad is often
served with rich entrees, to cut through the fat in the main dishes.
Yield: 4 Servings
Preparation Time: 20 minutes
Ingredient List:
1 seeded, diced green pepper, hot
¼ cup of diced onion, sweet
1 & ½ cups of diced cucumbers
2 cups of diced tomatoes, ripe
2 teaspoons vinegar, balsamic
4 teaspoons of lemon juice, fresh
1 teaspoon of oil, olive
¼ teaspoons of sea salt, coarse
¼ teaspoons of ground pepper, black
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Toss all ingredients together, except for the olive oil.
2. Sprinkle with olive oil. Serve.
Recipe 12: Ethiopian Cabbage
My family fell in love with this recipe, so I make it quite often. I actually
don’t peel the red potatoes, since the skin gives the dish some added color.
In the taste department, it needs no help.
Yield: 4-6 Servings
Preparation Time: 1 hour & 5 minutes
Ingredient List:
5 peeled, cubed potatoes
1 sliced onion
4 sliced carrots
½ head of shredded cabbage
3 to 4 tablespoons of oil, olive
1 teaspoon of salt, sea
½ teaspoons of cumin, ground
½ teaspoons of black pepper, ground
¼ teaspoons of turmeric, ground
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. In medium-sized skillet, heat oil on med. heat. Add onions and carrots.
Cook for four to five minutes.
2. Add cabbage, turmeric, cumin, salt and ground pepper. Cook for 15-20
more minutes.
3. Add potatoes and stir. Cover skillet. Reduce the heat to med-low. Cook
for an additional 15-20 minutes. Potatoes should be soft. Serve hot.
Recipe 13: Injera (Ethiopian Flat Bread)
I’m including this bread recipe because this is what Ethiopians use as a fork
or spoon when they eat. This is not authentic, since Teff flour is used in
Ethiopia, and it’s very difficult to find elsewhere. But the taste is very
similar.
Yield: 15-20 Servings
Preparation Time: 1 hour & 45 minutes
Ingredient List:
3 & ½ cups of water, warm
1 tablespoon of dry, active yeast
½ cup of corn meal
½ cup of flour, whole wheat
3 cups of flour, self-rising
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Mix all ingredients, forming the batter.
2. Allow to set in a large sized, covered bowl for one or more hours. Batter
will rise and become stretchy. You can leave it sitting for up to six hours, if
needed.
3. Stir the batter to mix any liquid that has settled on the bottom.
4. Use a blender to whip, two cups at a time, and thin with water. Batter will
be very thin.
5. Cook without oil in a non-stick pan on med. heat.
6. Pour batter in installments into heated pan. Swirl in the pan to spread the
batter thinly. It shouldn’t be any thicker than about 1/8”.  Do not flip.
7. Injera is done when you can see bubbles on top. It will not burn or stick
easily. 
8. Lay the injera pieces on a towel for a couple minutes. Then stack in a
covered dish and keep them warm.
9. Finished injera are thicker than crepes, but thinner than pancakes. Serve
with just about anything you can make with Ethiopian recipes.
Recipe 14: Mild Beef Stew
Unlike the berbere dishes of Ethiopia, this recipe stays away from the hotter
spices. You can safely share it with anyone who likes savory beef stew.
Yield: 10 Servings
Preparation Time: 50 minutes
Ingredient List:
½ cup of water, filtered
2 teaspoons of coarse salt, if desired
2 teaspoons of Alicha Kimem (Ethiopian stewing spice blend)
5 chopped onions, large
3 lbs. of cubed beef
1 to 2 teaspoons Ethiopian turmeric, or regular turmeric, as
available
2 teaspoons of ginger, powdered
5 teaspoons of garlic, minced
2 cups of oil, vegetable
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Simmer garlic and onion in oil in a large sized pot until they are browned
lightly.
2. Add the turmeric. Continue simmering for 15 minutes or so, stirring
occasionally, over low heat.
3. Add water and beef. Simmer till beef has cooked. Add salt and Alicha
Kimem. Serve with injera bread or suitable locally sourced alternative. 
Recipe 15: Ground Nut Stew
Okra and peanut better thicken and flavor this tempting African stew. Green
beans can be used instead of okra, if you prefer them. The consistency of
your sauce will be a bit different, but it is still sufficiently thick to allow it
to coat the chicken well.
Yield: 4 Servings
Preparation Time: 45 minutes
Ingredient List:
1 x 10-oz. pkg. of sliced okra, frozen
3 to 3 & ½ lbs. of chicken, eight pieces total
1 & 3/4 tablespoons of oil for cooking, + extra if you need it
2 tablespoons of tomato paste
1 chopped onion, medium
½ cup of peanut butter, creamy
2 & ¾ cups of water, filtered
1 cup of drained crushed tomatoes, canned
1 & ¾ teaspoons of salt, kosher
½ teaspoons of black pepper, ground
¼ teaspoons of cayenne pepper
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Heat oil on med-high in a large sized pot. Season chicken pieces using ¼
teaspoons each of salt & pepper.
2. Cook chicken until it browns. Turn to cook evenly. It should take eight to
10 minutes. Remove from heat. Pour off all fat except for 1 tablespoon Set
that aside.
3. Reduce heat to med-low. Add onion to pot. Stir occasionally while
cooking until it starts to soften up. Add tomato paste and tomatoes and stir
them in. Add cayenne pepper.
4. Return chicken meat to pot. Add 2 cups water. Bring up to simmer.
Partially cover and cook for about 10 minutes.
5. Whisk ¾ cup of water and peanut butter together until the consistency is
smooth. Add to stew, along with chicken meat, fat, okra, 1 & ½ teaspoons
of salt and ¼ teaspoons of pepper.
6. Leave partially uncovered and cook till okra is barely done. This takes
eight to 10 minutes.
7. Serve with noodles or rice to soak up tasty sauce.
Recipe 16: Gomen
This dinner features the Ethiopian version of collard greens. You can cut
down on the recommended oil amount, if you like, and add different spices
if you prefer a milder taste.
Yield: 6 Servings
Preparation Time: 1 hour & 20 minutes
Ingredient List:
¾ cup of onions, chopped
1 tablespoon of oil, olive
8 chopped garlic cloves
2 cups of water, filtered
1 lb. of rinsed, trimmed, chopped collard greens
1 tablespoon of lemon juice, fresh
1 & ½ cups of sliced bell pepper, green
2 tablespoons of minced ginger root, fresh
1 teaspoon of salt, kosher
½ teaspoons each of ground allspice, paprika and ground
turmeric
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Place greens in large pot with 2 cups water. Bring to boil. Reduce the
heat to low.
2. Cover pot. Simmer till the collard greens become tender. Drain and
reserve water used for cooking. Set them aside.
3. Heat 1 tablespoon of oil in pot on med. heat. Add onions and stir. Cook
till they begin to brown. Add garlic and stir. Cook for a minute.
4. Add in cooked collard greens, 1 tablespoon of oil and reserved cooking
water. Leave uncovered and simmer on med-high until liquid nearly
evaporates.
5. Add ginger root, allspice, paprika, turmeric, salt, lemon juice and green
pepper slices. Cook till peppers become soft. Combine and serve hot.
Recipe 17: Yams & Lentils
If you have some sweet potatoes in your pantry, here is a great way to use
them. The Ethiopian spices really bring out their flavor. Yours likely won’t
taste the same as the dish when made in an Ethiopian restaurant, but it is
tasty, quick and hearty.
Yield: 1-2 Servings
Preparation Time: 35 minutes
Ingredient List:
1 cup of water, filtered
1 to 2 teaspoons of tomato paste
2 tablespoons of lentils
1 teaspoon of oil, olive
¼ diced bell pepper, sweet, red
½ diced sweet potato, small
1 teaspoon of minced ginger, fresh
3 minced cloves of garlic
½ diced onion, medium
½ teaspoons of coriander, ground
¾ teaspoons of paprika
¼ teaspoons each of ginger, fenugreek, cinnamon and allspice,
all ground
Salt, coarse
Pepper, ground
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Sauté sweet potato, ginger, garlic and onion in oil over med. heat till
onions have become nearly translucent.
2. Add red bell pepper. Sauté for a minute more. Add tomato paste, water
and lentils.
3. Bring water to boil. Add ginger, fenugreek, allspice, coriander and
paprika.
4. Lower the heat a bit. Allow stew to simmer for about 20 minutes. Water
should be absorbed and lentils should be tender.
5. Add salt and ground pepper, to taste. Serve.
Recipe 18: Spiced Steak
This dish is inspired by an Ethiopian stew that is flavored with berbere
spices. The same spices that bring other dishes to life work wonders to
create the fragrant flavor of this steak, which is roasted with seasonal
vegetables.
Yield: 4-6 Servings
Preparation Time: 1 hour & 40 minutes
Ingredient List:
1 head of lettuce, with leaves separated
1 baking potato, large, rinsed, dried, peeled & cut into 3-inch
by ¼” sticks
3 cups of oil, vegetable
4 tablespoons of butter, unsalted
1 & ½ tablespoons of berbere spice mixture
1 & ½-lb. steak, sirloin
½ sliced onion, red
2 teaspoons of vinegar, red wine
2 tablespoons of oil, olive
1 pint of halved cherry tomatoes, yellow
2 tablespoons of drained, chopped capers
1 pint of halved cherry tomatoes, red
2 tablespoons of parsley, chopped
3 celery ribs, large, sliced thinly + ½ cup of celery leaves
2 tablespoons of lemon juice, fresh
Sea salt, coarse
Ground pepper
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Sprinkle steak with 1 tablespoon of berbere spices. Allow to sit for one
hour at room temperature.
2. Preheat oven to 350F. On rimmed, large baking sheet, toss tomatoes with
oil. Season using salt & pepper. Bake for 40-45 minutes till tomatoes sizzle
and begin to brown.
3. Combine lemon juice with ½ tablespoons of berbere spices. Add celery
with leaves, onion, vinegar, capers and parsley together in medium sized
bowl. Toss to combine. Season using salt & pepper.
4. Melt butter in large sized skillet. Season steak using salt & pepper. Cook
on med-high for about five minutes, until browned richly. Turn steak. Cook
on med. heat until it is cooked to medium-rare. Transfer steak to carving
board for 10 minutes. Carve, mix with spice mixture and serve.
Recipe 19: Turmeric Carrots & Cabbage
When you cook the onions for this recipe and then stir in aromatic and
spices like ginger and garlic, you’ll have the basis for a wonderful dish. It is
spiced in a delicate way, with the earthy, homey taste of turmeric.
Yield: 6-8 Servings
Preparation Time: 1 & 1/2 hours
Ingredient List:
5 lbs. of cored, cubed cabbage, green
1 lb. of quartered carrots
2 tablespoons of turmeric, ground
1 x 2” piece of peeled, minced ginger, fresh
10 minced cloves of garlic
3 chopped medium onions, red
1/3 cup of oil, olive
Salt, as desired
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Heat olive oil in large sized cast-iron casserole. Add pinch of salt and
onions. Cook on med. heat and stir occasionally until onions soften.
2. Add turmeric, garlic and ginger. Stir and cook until they are beginning to
turn brown, and fragrant.
3. Add ½ cup water and carrots. Cook on med. heat and stir, till carrots
begin softening. Add cabbage in handfuls and stir as each handful is added.
When you have added all cabbage, cover casserole. Cook on med-low and
stir until cabbage becomes tender. This will take between 40 and 45
minutes.
4. Season using salt, as desired. Serve.
Recipe 20: Ingudai Tibs (Sautéed Mushrooms)
This dish has a wonderfully complex taste that belies how easy it is to
make. Traditionally, the recipe uses the berbere spice blend that makes so
many Ethiopian dishes delicious.
Yield: 6 Servings
Preparation Time: 25 minutes
Ingredient List:
1 pound of cleaned, quartered mushrooms, button type
2 diced tomatoes, medium
1 sliced red onion, large
1 sliced green pepper, large
2 tablespoons of oil, olive
For Awaze sauce:
1 teaspoon of lemon juice or white wine
2 or 3 minced cloves of garlic
2 teaspoons of berbere spice mixture
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Heat oil in a large sized skillet. Add tomatoes, onions and peppers. Cook
them on med-high until veggies are a bit soft.
2. Add the mushrooms. Increase the heat to med-high.
3. Mix sauce ingredients. Add it to mushrooms. Sauté over high heat for
three minutes or so, or until the mushrooms are cooked. Add salt as desired.
4. Garnish as desired. Serve with bread or rice.
Recipe 21: Timatim Salad
Jalapeño peppers and berbere spices are the main ingredients in this dish.
So, the salad does have some kick to it. You can feel free to alter the
amounts of these ingredients if you or your family don’t enjoy extremely
spicy foods.
Yield: 2-3 Servings
Preparation Time: 10 minutes
Ingredient List:
For the salad:
½ to 1 chopped onion
3 or 4 tomatoes, large
2 pieces of injera bread, torn into 1-inch pieces
1 or 2 de-seeded, chopped jalapeños
For the dressing:
1 or 2 minced garlic cloves
1 fresh lemon, juice only
2 teaspoons of berbere spice mixture (use less if you don’t
want a hot-spicy salad)
3 tablespoons of wine or vinegar
¼ cup of oil, canola
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Place salad ingredients in bowl and toss.
2. Combine dressing ingredients. Pour over veggies. Chill and serve.
Recipe 22: Sautéed Lamb
This dish tastes best with injera bread, not that this is surprising by now.
Any kind of flat bread will do, if you don’t have the ingredients available
for injera. Add a cucumber and tomato salad to make this a filling meal.
Yield: 3-4 Servings
Preparation Time: 40 minutes
Ingredient List:
1 sliced bell pepper, red
3 quartered hot peppers, green
1 sliced sweet onion, small
1 tablespoon of oil, olive
1 minced clove of garlic
12 oz. of lamb, lean
1 tablespoon of butter, unsalted
3 to 4 teaspoons of berbere spice mixture
1 pinch of kosher salt
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Cut the lamb into 2” thin strips. Mix with the garlic.
2. Heat oil on med-high. Sauté the hot peppers and onion until the onion
turns lightly golden.
3. Add salt and red pepper. Sauté until the red pepper becomes tender.
Transfer the onion mixture to a bowl.
4. In the same pan, melt the butter on high. Sauté meat mixture till seared
through. This takes a couple minutes.
5. Stir in berbere spices, as desired. Then sauté for ½ minute. Serve.
Recipe 23: Berbere Jackfruit Tacos
In these tasty tacos, onions and jackfruit meet the berbere spice mixture and
are baked until they have a perfect taste of spices and caramelization. You
can add chick peas if you like, making it even a heartier meal.
Yield: 3 Servings
Preparation Time: 45 minutes
Ingredient List:
1 chopped onion, medium
20-ounce can of jackfruit
1 tablespoon of olive oil
8 garlic cloves
½ teaspoons of sea salt, coarse
For flavor:
2 teaspoons of berbere spice mixture
2 teaspoons of paprika
1 teaspoon of coriander, ground
½ teaspoons of cumin, ground
1 or 2 tablespoons of BBQ sauce
2 teaspoons of soy sauce, low sodium
1 tablespoon of syrup, maple
¼ teaspoons of cinnamon, if desired
½ teaspoons of garlic powder
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Squeeze jackfruit between some paper towels to get rid of liquid.
2. Place jackfruit, onion and garlic in a food processor and process until
shredded coarsely. 
3. Transfer mixture to bowl. Mix in sauces and spices.
4. Preheat oven to 350F.
5. Spread mixture on a cookie sheet lined with baking paper. Make one
even layer.
6. Bake for 35-40 minutes at 350F. After the first 20 minutes, spread and
mix to move the center of the mixture outward. Taste and adjust seasonings,
if desired.
7. Prep tortillas. Add good-sized portion of jackfruit mixture. Add crunchy
vegetables like cucumbers. Add creamy tahini or your choice of dressing.
Serve.
Recipe 24: Potatoes & Cabbage
Your family may fall in love with this veggie dish. It was created by a
friend, who actually made it as a hybrid of several other recipes. It is served
as a side dish, with injera beside it.
Yield: 4 Servings
Preparation Time: 1 hour & 15 minutes
Ingredient List:
¼ cup of water, purified
4 cubed potatoes, yellow, small
2 minced garlic cloves
1 sliced head of cabbage, small
1 sliced onion
4 sliced carrots
1/3 cup of oil, olive
1 teaspoon each of ground cumin, ground turmeric and salt
½ teaspoons each of ground ginger and ground pepper
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Heat the oil in large sized pot on med. heat. Sauté the carrots in oil until
they soften slightly. Add the onion and sauté until fragrant.
2. Season the carrot mixture using ginger, pepper, cumin and turmeric. Stir.
Allow seasonings to toast until they are fragrant.
3. Stir the garlic and cabbage into carrot mixture. Stir occasionally while
cooking, till the cabbage has wilted.
4. Stir in potatoes. Pour water in pot. Stir. Bring liquid to boil. Reduce the
heat to med-low. Simmer and stir every 5-10 minutes until potatoes become
tender. Remove to bowls and serve.
Recipe 25: Buticha
This recipe is similar in some ways to traditional chick pea spreads used
along with other dishes in Ethiopia. If you’re not a chick pea fan, you can
also use chick pea flour or fava bean flour.
Yield: 1-2 Servings
Preparation Time: 1 hour & 10 minutes including 1 hour of chilling time
Ingredient List:
1 teaspoon of pepper flakes, red chili
1 cup of cooked chick peas
½ cup of onions, red
2 tablespoons of oil, olive
1 cup of water, filtered
½ juiced lemon
1 teaspoon of mustard
Salt, coarse
Pepper, ground
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Place all the ingredients in food processor. Blend until you achieve a
pasty, smooth consistency.
2. Pour into container with lid. Cover and put in your fridge to chill for an
hour or so. Serve chilled.
Recipe 26: Berbere Lentils
This is one of my favorite Ethiopian dishes. The spices are so intense,
thanks to the berbere blend. You can find this spice mixture at Ethiopian
grocers or order it online. This dish is usually served with injera flat bread.
Yield: 4 cups
Preparation Time: 50 minutes
Ingredient List:
3 cups of water, filtered, + extra as needed
1 cup of washed & dried lentils
2 teaspoons of fresh garlic, pureed
1 tablespoon of peeled, fresh ginger, pureed
½ cup of berbere spices, as desired
1 & ½ chopped onions, yellow, medium
¾ cup of oil, canola
½ teaspoons of sea salt, as desired
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Heat oil in a medium sized sauce pan on med. heat. Add the onions and
stir them while cooking for eight minutes.
2. Add garlic, berbere and ginger and stir. Stir as you cook for two minutes.
Add the lentils and stir while cooking for one minute. 
3. Add in three cups of water. Bring mixture to boil on high heat. Lower
heat to medium. Stir often while simmering and add more water if you
need, until the lentils have disintegrated and mixture forms thick stew. This
takes about 1/2 hour. Taste and add salt as desired. Serve.
Recipe 27: Kitfo (Steak tartar)
This dish is a bit like hamburgers, but the meat is raw (seared) and spicefilled. It is generally eaten with Ethiopian injera bread, rather than on a bun.
It is a stunning dish and a favorite in this African country.
Yield: 5 Servings
Preparation Time: 20 minutes
Ingredient List:
¼ cup seasoned butter (Neter kibe)
1 teaspoon of salt, as desired
1 teaspoon of korerima (Ethiopian cardamom)
1 teaspoon of Mitmita (prepared powdered seasoning mix)
3 lbs. of ground beef, lean
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Mix the beef and other ingredients well.
2. Sear lightly in pan.
3. Serve with injera – Ethiopian bread – or other locally available bread
Chapter III - Ethiopian Desserts
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Recipe 28: Ethiopian Fruit Salad
From baklava, which is very labor intensive, we come now to fruit salad,
which is simplicity in recipe form. It includes fresh fruit – that’s it. Be sure
everything else is ready before you peel the bananas.
Yield: 6 Servings
Preparation Time: 15 minutes
Ingredient List:
1 sliced banana
1 & ½ cups of grapes, seedless
1 orange with peel removed, then cut into sections
1 peeled, cubed papaya, ripe, small
1 peeled, cubed mango, ripe
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Combine the sliced and cubed fruits. Add banana just before serving.
Serve.
Recipe 29: Ethiopian Baklava
Baklava in Ethiopia? Yep! It is made in many countries in the region
Ethiopia shares with others.  This recipe includes a thick syrup, and it is
wildly popular, since desserts are not common in Ethiopia.
Yield: 1-2 Servings
Preparation Time: 2 hours and 10 minutes
Ingredient List:
¼ cup of water, distilled
1 cup of flour, all-purpose
1/5 tablespoons of salt, coarse
2 eggs, medium
1 & 1/3 cups of starch
1 teaspoon of oil, olive
For the filling:
1 & ½ cups of walnuts, ground
1 cup of margarine, melted
For the syrup:
2 cups of water, distilled
2 cups of sugar, granulated
2 teaspoons of juice, lemon
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
1. Prepare dough using recipe on flour package.
2. Place pieces of dough on wooden board atop each other.
3. Cut pieces using cooking tray size as gauge.
4. Lightly grease tray. Place ½ of dough pieces on tray. There should only
be one layer. Pour margarine over them.
5. When you have used ½ of dough, sprinkle a layer of walnuts over top of
it.
6. After the walnuts, make another dough layer. Spread with margarine.
Add another dough layer and margarine. Continue until all dough has been
used.
7. Cut dough pieces in baklava shapes. Place in oven on medium
temperature. Cook for one hour. They should appear golden and brown.
Remove from oven.
8. Place lemon juice, sugar and water in a pan. Melt sugar on med. heat on
stove top burner. Boil for 15 minutes or so until mixture has a syrup-y
consistency.
9. Remove syrup from burner. Brush baklava with butter and pour syrup on
top. Place on serving plate or pan and serve.
Recipe 30: Sanbusa Turnovers
Picture, if you will, an Indian samosa. That is somewhat like this dish, but
sanbusa is lighter and smaller, with a tasty, sweet filling. They are earthy,
yet still delicate, with a shell that is crispy thin and a yummy filling.
Yield: 10+ Servings
Preparation Time: 1 hour & 55 minutes
Ingredient List:
For the dough:
½ to ¾ cup of water, distilled, cold
2 teaspoons of sea salt, coarse
5 cups of flour, white
¾ cup of oil, olive
¾ cup of butter, unsalted
For the sweet filling:
2 tablespoons of rose water
1 tablespoon of water, distilled, with ¼ teaspoons of saffron
dissolved in it
2 teaspoons of cardamom
1 & ½ cups of sugar, granulated
3 cups of ground walnuts
HHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH
Preparation:
To make the dough
1. Melt butter in oil.
2. Combine salt & flour in medium bowl. Create a shallow well in center.
Add butter and oil into well.
3. Vigorously stir till well combined. Add water until dough is holding
together and pulling away from bowl sides a bit.
4. Wrap dough ball in cling wrap. Allow to set in fridge while you prepare
filling.
To make the sweet filling:
5. Combine ingredients. Stir well.
To assemble Sanbusa:
6. Preheat oven to 350F.
7. Use a walnut-sized dough piece for each pastry. Roll into 3” circles.
8. Place 1 teaspoon of sweet filling into center of dough circles. Fold them
into half-moons. Firmly pinch edges.
9. Place pastries on ungreased cookie sheet. Bake in oven for 45 minutes.
They should appear yellow-gold in color. Serve while warm. 
About the Author
Angel Burns learned to cook when she worked in the local seafood
restaurant near her home in Hyannis Port in Massachusetts as a teenager.
The head chef took Angel under his wing and taught the young woman the
tricks of the trade for cooking seafood. The skills she had learned at a
young age helped her get accepted into Boston University’s Culinary
Program where she also minored in business administration.
Summers off from school meant working at the same restaurant but when
Angel’s mentor and friend retired as head chef, she took over after
graduation and created classic and new dishes that delighted the diners. The
restaurant flourished under Angel’s culinary creativity and one customer
developed more than an appreciation for Angel’s food. Several months after
taking over the position, the young woman met her future husband at work
and they have been inseparable ever since.  They still live in Hyannis Port
with their two children and a cocker spaniel named Buddy.
Angel Burns turned her passion for cooking and her business acumen into a
thriving e-book business. She has authored several successful books on
cooking different types of dishes using simple ingredients for novices and
experienced chefs alike. She is still head chef in Hyannis Port and says she
will probably never leave!
Author's Afterthoughts
With so many books out there to choose from, I want to thank you for
choosing this one and taking precious time out of your life to buy and read
my work. Readers like you are the reason I take such passion in creating
these books.
It is with gratitude and humility that I express how honored I am to become
a part of your life and I hope that you take the same pleasure in reading this
book as I did in writing it.
Can I ask one small favour? I ask that you write an honest and open review
on Amazon of what you thought of the book. This will help other readers
make an informed choice on whether to buy this book.
My sincerest thanks,
Angel Burns
If you want to be the first to know about news, new books, events and
giveaways, subscribe to my newsletter by clicking the link below
https://angel-burns.gr8.com
or Scan QR-code