OceanofPDF.com
Sicilian Chicken
Chicken is the simplest ingredient to work with because it can be used in a
thousand different ways. This Sicilian chicken is juicy and tender and will
brighten any mealtime effortlessly. It’s healthy and flavorsome and hits the
right notes beautifully.
Serving Size: 4
Cooking Time: 50 Minutes
Ingredients:
4 boneless chicken breast fillets
14 oz. of quartered marinated artichoke hearts, jarred
1 sliced red onion
2 oz. of chopped capers
18 oz. of new baby potatoes, halved
8 oz. of chopped tomatoes
1 thinly sliced squash
1 thinly sliced zucchini
½ cup of pitted and sliced olives
½ cup of white wine
½ cup of chicken broth
2 tablespoons of olive oil
4 teaspoons of ground cumin
3 tablespoons of finely chopped basil
Salt and pepper for seasoning
Instructions:
1. Preheat your oven to 400 degrees Fahrenheit and fill a large
mixing bowl ¾ of the way with hot water. Add the baby
potatoes to the bowl and cover them with saran wrap, then put
them in the microwave for 3 minutes.
2. Add oil to a deep pan and gently heat it at a medium
temperature for 60 seconds.
3. Remove the potatoes from the microwave and put them into
the pan with the tomatoes, olives, artichokes, onion, capers,
zucchini, and squash. Season them generously with salt and
pepper and cook for 5 minutes, but stir them often so they
cook evenly.
4. Sprinkle salt, pepper, and cumin on both sides of the chicken
then place it on top of the vegetables. Pour the broth and wine
into the pan and cook for a good 35-40 minutes or until the
chicken is cooked through.
5. Finish with a sprinkle of basil on top.
OceanofPDF.com
Beefsteak (Bistecca alla Fiorentina)
Fiorentina steak is delightful and a true Italian classic. T-bone steaks are
often the number one choice for this dish but porterhouse steaks work just
as well. While typically served rare, you could choose medium-rare or welldone, just remember to alter your cooking times slightly. Throw in a small
salad and you’ve got a great meal for any busy or slow evening.
This is sure to be a crowd-pleaser.
Serving Size: 2
Cooking Time: 15 Minutes
Ingredients:
35 oz. of T-bone steak (1-inch thick)
½ cup of olive oil
2 slices of white bread, cubed and with the crusts removed
24 oz. of chopped romaine lettuce
1 cubed bell pepper
½ cup of grated parmesan cheese
½ cup of pitted and halved black olives
1 chopped red onion
8 oz. of sliced fresh tomatoes
1 teaspoon of sugar
1 teaspoon of crushed chili flakes
½ teaspoon of garlic powder
3 tablespoons of red wine vinegar
2 ½ tablespoons of finely chopped basil
Salt and pepper for seasoning
Instructions:
1. Preheat your oven to 400 degrees Fahrenheit for 7-10
minutes, then coat the bread with 1 tablespoon of olive oil.
Scatter the bread on a baking sheet and bake it in the oven for
8-12 minutes to make croutons. Remove and set them aside to
cool once ready.
2. Heat a griddle pan at a medium-to-high temperature for 2-3
minutes, then season the steak with salt and pepper. Rub 1
tablespoon of oil on top then add to the grill and sear for 3
minutes. Flip the steak over and cook for a further 3 minutes.
Cooking times, however, depend on the size and thickness of
the steak. You can cook a few minutes longer on each side if
you prefer a medium-rare steak.
3. Remove the steak from the griddle pan and let it rest for 10
minutes.
4. Add the remaining oil to a measuring jug and combine it with
red wine vinegar, sugar, garlic powder, 5 teaspoons of
parmesan, chili flakes, 1 teaspoon of basil, and a pinch of salt
and pepper. Whisk well until a thin dressing forms.
5. Add the lettuce, bell pepper, onion, tomatoes, olives,
croutons, and the remaining parmesan to a large serving bowl.
Use salad tongs to toss to combine then drizzle the dressing
on top to create the ultimate Italian salad.
6. Slice the steak and serve alongside the salad. Finish with a
sprinkle of basil on top.
OceanofPDF.com
Mozzarella, Red Onion, and Bacon Calzone
Calzones are fun, filling, and super tasty. It’s different but one you will love
to have time and again. Use different fillings to keep them appealing or
stick to your favorite fillings and you’re guaranteed to enjoy every time.
You can enjoy them any night of the week, regardless of how busy you
might be.
Serving Size: 2
Cooking Time: 20-25 Minutes
Ingredients:
6 oz. of thinly sliced mozzarella cheese
12 oz. of passata
2 ½ tablespoons of sunflower oil
2 chopped tomatoes
4 chopped bacon rashers
3 beaten eggs
2 ½ teaspoons of baking powder
10 oz. of plain flour
10 oz. of sliced pepperoni
2 oz. of finely grated cheddar cheese
2 finely diced jalapeno peppers
1 sliced red onion
2 teaspoons of Italian seasoning
2 tablespoons of water
Salt and pepper for seasoning
Instructions:
1. Heat a skillet at a medium temperature for 1 minute then add
the bacon and gently fry it for 5 minutes. Remove it from the
skillet and set it on paper towels to drain any excess grease or
fat from the bacon.
2. Add the beaten eggs to a large mixing bowl then combine it
with oil, baking powder, a pinch of salt and pepper, and all but
2 tablespoons of flour until a dough begins to form. This
might take 2-3 minutes, depending on how quickly the dough
comes together. You might need to add a tablespoon or two of
water to thin the dough out as well.
3. Preheat the oven to 400 degrees Fahrenheit and place a large
baking sheet in the oven to heat through for 10 minutes.
4. Use 2 tablespoons of flour to dust a clean surface then split
the dough into two equal-sized pieces. Roll each piece of
dough into 10-inch semi-thick consistencies.
5. Spread the passata on each dough piece then sprinkle 1
teaspoon of Italian seasoning on top of the sauce. Spread the
mozzarella, bacon, onion, pepperoni, tomatoes, cheddar
cheese, jalapeno, and a pinch of salt and pepper on each
calzone then carefully fold the dough over and seal the edges
with a fork.
6. Remove the baking sheet from the oven and place it on a
cooling rack for a moment while you carefully place each
calzone onto it. Place the calzones in the oven to bake for a
good 20 minutes.
7. Remove and serve immediately to enjoy the full flavor of the
calzone.
OceanofPDF.com
Fish Puttanesca (Pesce alla Puttanesca)
One of the most delicate Italian meals to serve has to be Pesce alla
Puttanesca. The tilapia brings beautiful flavors and never disappoints. It’s a
rustic dish but one that will leave you wanting more. For those who want to
make mealtimes a little more interesting, this is the dish for you. It’s
gorgeous and easy to prepare.
Serving Size: 4
Cooking Time: 35 Minutes
Ingredients:
18 oz. of tilapia fillets, halved
1 white diced onion
3 oz. of chopped anchovies
32 oz. of crushed tomatoes, canned
8 minced garlic cloves
3 tablespoons of olive oil
10 slices of thick-cut rustic bread
10 teaspoons of garlic butter
½ cup of dry white wine
1 tablespoon of rinsed and drained capers
1 cup of pitted and halved olives
5 tablespoons of finely chopped parsley
1 teaspoon of ground oregano
¼ teaspoon of cinnamon
Salt and pepper for seasoning
Instructions:
1. Pour the oil into a large pan or soup pot and gently heat it at a
medium temperature for 1 minute. When the oil is hot, add the
onions and cook them for 6 minutes, then add the garlic and
cook for a further 1 minute.
2. Add the anchovies to the pan and cook them for 3 minutes
and stir every minute to prevent anything from burning.
3. Pour the wine into the pan and cook for 2-3 minutes (as this
will burn off the alcohol element), then mix in the cinnamon,
oregano, and tomatoes. Let the mixture simmer for a good 10
minutes and stir every few minutes.
4. Add the capers and olives and cook them for 2 minutes.
Season the mixture with salt and pepper then mix in half of
the parsley and cook for 1 minute more.
5. Rub salt and pepper on the tilapia fillets then add them to the
pan. Spoon the sauce over the fish and cover and cook for 8
minutes or until the tilapia is cooked through.
6. Spread the garlic butter on the bread then remove the
puttanesca from the heat and divide onto plates. Top with the
remaining parsley and serve the bread on the side to finish.
OceanofPDF.com
Mascarpone and Tomato Crispy Cod Bake
A fish bake might not sound overly exciting but this beautiful Italianinspired one will make mealtime fun. While this mascarpone and tomato
crispy cod bake is simple it combines beautiful flavors to create a standout
dish.
Cod can also be substituted for any white fish if you so wish.
Serving Size: 4
Cooking Time: 20 Minutes
Ingredients:
4 cod fillets
32 oz. of chopped tomatoes, canned
2 oz. of breadcrumbs
10 oz. of mascarpone cheese
3 minced garlic cloves
2 tablespoons of olive oil
8 slices of thick-cut rustic bread
3 tablespoons of finely chopped basil
2 tablespoons of roughly chopped parsley
8, 1-inch-thick slices of mozzarella cheese
2 oz. of parmigiano Reggiano cheese
Salt and pepper for seasoning
Instructions:
1. To create the mascarpone and tomato sauce, add oil to a
saucepan and gently heat it for 30 seconds. Add the garlic and
fry it for 2 minutes to help release the aromas better.
2. Put the tomatoes into the saucepan and bring them to a boil at
a medium heat, then let them simmer and cook for 6-7
minutes. Stir the mascarpone and basil into the pan and mix
well until a creamy sauce-like texture forms. This might take
2 or 3 minutes to achieve.
3. Season the cod with salt and pepper then add it to the pan and
bring it to a boil. Mix in the parsley and let it simmer for a
good 10 minutes.
4. Preheat your grill to a medium temperature for 5 minutes,
then combine the breadcrumbs and Parmigiano Reggiano
cheese to create a topping for the fish.
5. Remove the cod from the heat and layer the mozzarella on top
of the cod. Sprinkle the breadcrumb mixture on top and put
under the grill for 5 minutes to finish cooking.
6. Divide the puttanesca onto plates and serve with a few slices
of thick-cut bread.
OceanofPDF.com
Roman Pasta (Cacio E Pepe)
Cozy with the traditional flavors of Italy, this cheese and pepper pasta is a
dish that’ll make mealtimes a lot more appealing. It’s a simple but quality
dish to enjoy today.
Serving Size: 4-6
Cooking Time: 10 Minutes
Ingredients:
3 cups of finely grated pecorino cheese
16 oz. of spaghetti pasta
4 tablespoons of crushed black peppercorns
Salt for seasoning
Instructions:
1. Put the crushed peppercorns into a skillet and toast them at a
medium temperature for 3 minutes. You want to move the
peppercorns every few minutes with a wooden spoon so they
don’t burn.
2. Remove the peppercorns from the heat and set them aside on
a plate for a few moments.
3. Pour cold water into a large pot, filling it to 75% capacity, and
season with a pinch of salt. Heat the water over medium-high
heat until it reaches a rolling boil. Subsequently, stir in the
spaghetti and allow it to cook for 7 minutes.
4. Drain the pasta once it’s ready but retain at least 2 or 3 cups of
cooking liquid.
5. Add 1 cup of cooking liquid to a second saucepan and heat it
at a medium temperature for 1 minute then add the pecorino
cheese and melt. Stir the cheese as it melts until it creates a
creamy ricotta-like consistency. Season with a pinch of salt,
then add ¼ cup of water if the sauce is too thick.
6. Put the peppercorns into the pan and heat them through with
the sauce for 2 minutes. Add 4 tablespoons of water then put
the spaghetti into the sauce. Heat it through for a minute then
remove and serve immediately.
OceanofPDF.com
Stuffed Manicotti
Manicotti is great for vegetarians and meat eaters alike. It’s comforting but
delicious and will be a great dish for everyone to enjoy. Plus, there are lots
of different flavor combinations to try that will liven up any dinner table.
Serving Size: 4
Cooking Time: 1 Hour 40 Minutes
Ingredients:
10 manicotti pasta tubes
10 oz. of washed and torn spinach leaves
1 ½ cups of ricotta cheese
2 cups of shredded parmesan cheese
32 oz. of chopped tomatoes, canned
1 finely diced red onion
7 minced garlic cloves
¾ cup of red wine
2 tablespoons of finely chopped basil
4 tablespoons of olive oil
Salt and pepper for seasoning
Instructions:
1. Add 3 tablespoons of oil to a large pan and heat at a medium
temperature for 60 seconds, then add the diced onions and
garlic and cook them for a good 7 minutes. Stir often so they
don’t burn, then add the basil, tomatoes, and wine. Cover and
cook for 40 minutes to create a thin sauce.
2. Fill a large pan with water and a pinch of salt, then bring it to
a boil at a medium-to-high temperature. Add the manicotti
pasta to the pan and cook for 10 minutes as the water
continues to boil.
3. Add 1 tablespoon of oil to a saucepan and gently heat it at a
medium temperature for 60 seconds. Put the spinach into the
pan and cook it for 3 minutes or until it begins to wilt.
4. Remove the spinach from the heat and drain the excess oil.
Add the ricotta to the pan and season with a pinch of salt and
pepper then combine with the spinach to create the manicotti
filling.
5. Preheat your oven to 400 degrees Fahrenheit then remove the
manicotti sauce from the heat and use an immersion blender
to thin the sauce out (if necessary). You may not have to do
this, depending on the consistency of the sauce. Add a pinch
of salt and pepper and give the mixture one final stir.
6. Drain the manicotti pasta thoroughly then carefully fill each
with the spinach and ricotta cheese mixture.
7. Pour ¾ of the manicotti sauce onto a baking dish then add the
manicotti-filled pasta and pour the remaining sauce on top.
Sprinkle the parmesan over the pasta then cover with
aluminum foil and bake in the oven for 35-40 minutes.
OceanofPDF.com
Eggplant Parmesan
For those who want a comfort dish, eggplant parmesan has to be it. It’s
incredible and really makes mealtimes enjoyable. It’s simple to make but
tastes fantastic and will be a beloved dinner by all.
Serving Size: 4-6
Cooking Time: 50 Minutes
Ingredients:
1 thinly sliced eggplant
8 cups of tomato and basil pasta sauce
2 beaten eggs
1 cup of finely grated parmesan cheese
½ cup of breadcrumbs
1 ¼ cup of flour
Cooking spray
Salt and pepper for seasoning
Instructions:
1. Preheat your oven to 400 degrees Fahrenheit then grease 2
ovenproof dishes with cooking spray.
2. Crack and beat the eggs in one bowl, then add flour to a
second bowl and combine it with a pinch of salt and pepper.
3. Coat each slice of eggplant in the flour mixture then dip it in
the egg and place it into one of the greased dishes. Put the
eggplant in the oven for 10-12 minutes but put the second
dish in the oven as well so that it can heat through.
4. Remove the eggplant from the oven and reduce your oven to
350 degrees Fahrenheit.
5. Remove the dish from the oven and place it on a cooling rack
for a moment. Pour half of the pasta sauce into the bottom of
the dish, then add a layer of eggplant followed by the
remaining sauce.
6. Sprinkle half of the parmesan on top and cover with
aluminum foil. Bake the eggplant parmesan in the oven for 15
minutes.
7. Combine the remaining parmesan with breadcrumbs, then
remove the dish from the oven. Discard the foil and sprinkle
the parmesan and breadcrumb mixture on top.
8. Bake uncovered for a further 10 minutes.
9. Once cooked, remove from the oven and let it rest for 7-10
minutes before serving.
OceanofPDF.com
Tuna, Capers, and Chili Linguine
Linguine is a staple of Italian cuisine but it is also one of the more adaptable
ingredients to work with too. This tuna, capers, and chili linguine is fun,
healthy, and delicious. It’s one dish you’ll love to make for all the family.
Serving Size: 2
Cooking Time: 15 Minutes
Ingredients:
8 oz. of linguine pasta
1 freshly diced tomato
8 oz. of drained tuna, canned
2 teaspoons of drained and chopped capers
1 diced red chili pepper
1 minced garlic clove
The zest of 1 lemon
4 oz. of washed rocket leaves
3 tablespoons of finely chopped parsley
1 tablespoon of olive oil
The juice of 1 lemon
Salt and pepper for seasoning
Instructions:
1. Fill a pan with water and a pinch of salt then bring it to a boil
at a medium-to-high heat. Once the water boils, add the
linguine and cook it for a good 6-7 minutes at a medium heat.
2. Once ready, remove the linguine from the heat and drain it but
retain at least 1 cup of cooking liquid.
3. Add oil to a pan and gently heat it at a low temperature for 1
minute. Add the chili pepper and garlic and cook them for 2
minutes but stir them often to prevent them from burning.
4. Add the linguine and ½ cup of cooking liquid to the pan and
toss to mix with the chili and garlic. Put the tuna, capers, and
lemon zest into the pan and season with a pinch of salt and
pepper then cook for 2 minutes.
5. Mix in the lemon juice, rocket, and tomatoes and cook for 1
minute more. Then remove and top with parsley to finish.
OceanofPDF.com
Lasagna Soup
Lasagna lovers will adore this soup. It’s hearty and comforting and comes
with everything you’d want in a lasagna soup. While it does sound strange,
this soup is a wonderful dish that’ll make mealtimes a lot more interesting.
Serving Size: 6-8
Cooking Time: 40 Minutes
Ingredients:
24 oz. of ground beef
10 oz. of lasagna noodles, broken into small squares
7 minced garlic cloves
3 diced shallots
18 oz. of crushed tomatoes, canned
18 oz. of diced Roma tomatoes
4 tablespoons of tomato puree
10 oz. of ricotta cheese
8 oz. of finely shredded mozzarella cheese
4 oz. of finely grated parmesan cheese
6 cups of chicken stock
2 tablespoons of olive oil
1 teaspoon of ground thyme
1 teaspoon of ground oregano
1 teaspoon of crushed red chili pepper flakes
4 oz. of chopped basil
Salt and pepper for seasoning
Instructions:
1. Pour 1 tablespoon of oil into a skillet and heat it at a mediumto-high temperature for 30 seconds. Add the ground beef and
brown it for a good 7 minutes. Season the beef well with salt
and pepper and use a wooden spoon or spatula to break the
meat up as it cooks so that it browns evenly.
2. Once the beef is browned fully, remove it from the heat and
carefully drain any fat from the skillet. Set the beef to one
side for a few moments.
3. Add the remaining oil to a large soup pot and heat it at a
medium temperature for 1 minute. Put the shallots into the pot
and cook them for 3-4 minutes or until they’ve softened, then
add the garlic and cook for 2 minutes.
4. Pour the stock into the pot and stir well, then mix in the diced
tomatoes, tomato puree, crushed tomatoes, thyme, oregano,
chili flakes, and ¾ of the basil. Add the beef to the pot and
mix well to combine.
5. Bring the soup to a boil then reduce to a low-to-medium heat.
Cover and let the soup simmer gently for 20 minutes.
6. Pour water into a pan and bring to boil at a medium-to-high
heat, then add the egg noodles and cook them for 7 minutes.
7. In a bowl, combine the mozzarella, ricotta, and parmesan
cheese.
8. Drain the pasta and mix it into the soup with the remaining
basil, then divide it into bowls and top it off with the cheese
mixture to finish.
OceanofPDF.com
Onion, Sausage, Potato, and Pepper Bake
Comforting, with lots of interesting flavors vying for your attention, this
onion, sausage, potato, and pepper bake will brighten up mealtimes. It’s a
dish that everyone will enjoy and can be adapted to suit whatever you have
available at home. Plus, this bake is super easy to make even on a busy
weeknight.
Serving Size: 10
Cooking Time: 45 Minutes
Ingredients:
32 oz. of Italian or Kielbasa sausages, sliced thickly (around
2-inches)
6 peeled and sliced potatoes
5 thinly sliced bell peppers
4 white onions sliced into thin wedges
4 peeled and diced carrots
2 sprigs of thyme
2 teaspoons of ground rosemary
2 teaspoons of oregano
1 teaspoon of ground basil
¾ cup of vegetable stock
½ cup of olive oil
¾ cup of dry white wine
Cooking spray
Salt and pepper for seasoning
Instructions:
1. Preheat your oven to 400 degrees Fahrenheit then grease an
ovenproof casserole dish with cooking spray.
2. Pour 1 tablespoon of oil into a skillet and heat it at a medium
temperature for 30 seconds, then add the sausages and brown
them for 7-8 minutes. Flip the sausages over every 2 minutes
so that both sides cook evenly.
3. Once the sausages are browned, remove them from the heat
and drain any excess fat from them. Then put the sausages
into the greased casserole dish.
4. Pour the remaining oil into the skillet and heat for 30 seconds
before adding the potatoes. Cook them for a good 5 minutes
but stir them often, then add the bell peppers, onions, and
carrots, and continue to cook for 5-6 minutes.
5. Remove the potatoes, onions, carrots, and bell peppers from
the heat and pour them into the casserole dish.
6. Pour the stock and wine into the casserole dish, then mix in
the oregano, basil, rosemary, and a pinch of salt and pepper.
Add the sprigs of thyme then place in the oven for 25
minutes.
7. Once cooked, remove the bake from the oven and lightly
season, if necessary, to finish.
OceanofPDF.com
Pan Seared Steaks with Onions, Radishes, and
Tomatoes
With Italian influences, these steaks with onions, radishes, and tomatoes are
just gorgeous. It’s a dish that’ll liven up any dinner table and leave you
wanting more.
Serving Size: 2
Cooking Time: 15 Minutes
Ingredients:
2, 8 oz. steaks
1 sliced white onion
2 thinly sliced radishes
14 oz. of fresh quartered tomatoes
¾ cup of red wine
4 oz. of butter
1 tablespoon of olive oil
1 diced red chili pepper
3 tablespoons of finely chopped basil
Salt and pepper for seasoning
Instructions:
1. Heat a skillet at a medium-to-high temperature for 2 minutes,
then add half of the butter and let it melt for a few seconds.
2. Season the steaks generously with salt and pepper then add
them to the hot skillet. Cook the steaks for a good 4 minutes
then flip them over and cook for a further 4 minutes. Spoon
the butter over the steaks as they cook as this helps make
them juicer. Cooking times for the steaks, however, will
depend on your preferences.
3. Remove the steaks from the pan and set them on a chopping
board to rest for 8-10 minutes.
4. Add oil to the skillet (that you cooked the steaks in) and heat
it at a low-to-medium temperature for 1 minute then add the
sliced onions and cook them for 10-12 minutes.
5. Put the remaining butter into a saucepan and melt it at a
medium heat for 1 minute. Add the radishes and season them
with a pinch of salt and pepper, then cook them for 10
minutes but flip halfway through.
6. Add the wine to the pan and gently bring it to the boil. Let the
pan simmer for 3 minutes to burn the alcohol from the wine,
then add the tomatoes and diced chili pepper and cook for a
further 3-5 minutes.
7. Slice the steaks then add them and the onions to the pan with
the radishes. Mix well then let the steaks briefly heat through
for 30-60 seconds.
8. Remove and top with basil to finish.
OceanofPDF.com
Sauteed Mushrooms, Onions, and Peppers
While this would be typically a side dish in Italy, it works perfectly as a
main meal too. It’s hearty, filling, and bursting with Mediterranean flavors.
This is a dish that’s perfect for any night of the week and can be pretty
versatile too.
Serving Size: 2
Cooking Time: 10 Minutes
Ingredients:
32 oz. of sliced button mushrooms
1 diced red onion
1 finely sliced bell pepper
12 oz. of spinach leaves
2 cups of Italian dressing
2 teaspoons of oregano
1 diced chili pepper
4 oz. of chopped parsley
2 tablespoons of soft butter
4 tablespoons of water
Salt and pepper for seasoning
Instructions:
1. Heat a large skillet at a medium-to-high temperature for 1
minute, then add the butter and mushrooms. Season them with
a pinch of salt and pepper then cook for 7 minutes. Coat the
mushrooms in the butter then add the bell pepper, chili
pepper, and diced onions to the skillet, then cook them for 3
minutes.
2. Mix the Italian dressing and oregano into the skillet and cook
for a further 4-5 minutes, then add the water and spinach and
cook it for around 3-4 minutes or until it begins to wilt.
3. Remove the skillet from the heat and finish with a sprinkle of
parsley on top.
OceanofPDF.com
Homemade Diavolo Pizza
Homemade pizzas are fun, simple, and so easy to make. You can get
everyone involved in making it and it’s just a great option for dinner. The
Diavolo – devil’s pizza – is gorgeous. It has the right amount of heat and
spiciness to it and you can easily switch around toppings if you want to.
Serving Size: 1-2
Cooking Time: 15 Minutes
Ingredients:
2 ¾ cups of flour
¾ cup of water
½ teaspoon of rapid-rise or instant yeast
3 tablespoons of olive oil
½ teaspoon of salt
½ cup of spicy pizza sauce
4 oz. of shredded mozzarella cheese
¼ cup of pitted and chopped olives
2 sliced hot chili peppers
12 slices of spicy salami
½ teaspoon of crushed black pepper (optional)
Instructions:
1. To a stand mixer, add 2 ½ cups of flour, salt, and yeast. Use a
dough hook to gently mix the flour, then slowly add the water
and 2 tablespoons of oil. Knead until a dough forms (around
5-6 minutes on a low speed).
2. Grease a bowl with the remaining tablespoon of oil then
remove the dough from the mixer and place it in the bowl.
Cover the bowl with saran wrap and let it rise for 2 ½ hours.
3. Remove the dough from the bowl then sprinkle the remaining
flour on a clean surface and gently roll the dough into a ball
shape. Cover the dough with saran wrap and let it rest for 30
minutes more.
4. Preheat your oven to 425 degrees Fahrenheit then roll the
dough out into a 12-inch medium-thick base. Put the base on a
large baking sheet then place it in the oven for 5 minutes to
crisp up.
5. Remove the pizza from the oven then place it on a cooling
rack for a moment. Pour the sauce on the base but stop around
an inch from the edge. You might not need all of the sauce; it
depends on how much you prefer to use.
6. Sprinkle the mozzarella cheese on the pizza, then add the
salami, hot chili peppers, and olives. If you want to add a little
more heat, sprinkle a pinch of pepper on top too. Place the
pizza in the oven for 8-12 minutes or until cooked to your
liking.
OceanofPDF.com
Chicken Parmesan
Want a meat version of the eggplant parmesan? This chicken parmesan is
exceptional. Mozzarella, marinara sauce, and chicken, there is really no
better combo. It’s tender and will liven up your mealtimes. While you can
opt for pre-made marinara sauce, making one from scratch is fun and easier
than it sounds.
Serving Size: 4-6
Cooking Time: 50 Minutes
Ingredients:
4 boneless chicken breast fillets, halved
32 oz. of crushed tomatoes, canned
¾ teaspoon of dried oregano
7 tablespoons of olive oil
2 ½ cups of grated mozzarella cheese
1 ½ tablespoons of finely minced basil
1 small diced white onion
5 minced garlic cloves
¾ cup of breadcrumbs
¾ cup of all-purpose flour
¾ cup of finely grated parmesan cheese
1 teaspoon of ground cumin
¾ teaspoon of red chili powder
16 oz. of spaghetti
3 eggs
2 tablespoons of finely chopped parsley
Cooking spray
Salt and pepper for seasoning
Instructions:
1. To create a marinara sauce, add diced onions and 3
tablespoons of olive oil to a saucepan and fry them for 6
minutes. Mix the garlic into the pan and cook for a further 2
minutes.
2. Add the tomatoes to the pan, then mix in the chili powder,
oregano, basil, cumin, and a pinch of salt and pepper. Stir well
to combine then bring the mixture to a gentle boil. Cover with
the lid and simmer gently on a low heat for 15-20 minutes or
until a marinara-like texture is formed. Remove the sauce
from the heat and set aside for a moment.
3. Add flour to a bowl and season it with a pinch of salt and
pepper. In a second bowl, break and whisk the eggs for 15-20
seconds. In a third bowl, add the breadcrumbs and combine
them with parmesan.
4. Preheat your oven to 425 degrees Fahrenheit then grease a
baking dish with cooking spray and place it in the oven for 10
minutes.
5. Pour the remaining oil into a large pan and gently heat it at a
medium temperature for 2-3 minutes.
6. Wrap the chicken in saran wrap and gently pound it for 30
seconds with a cooking mallet to tenderize the meat so they
have the same thickness. Unwrap the chicken then dip each
piece into the flour, followed by the eggs, and finally the
breadcrumb mixture.
7. Add the coated chicken to the pan and cook it for 3 minutes.
Turn the chicken over and cook it for a further 3 minutes.
8. Remove the baking dish from the oven and place it on a
cooling rack for a few minutes. Pour ½ of the marinara sauce
into the baking dish then add the chicken. Pour the remaining
sauce on top of the chicken then sprinkle on the mozzarella
cheese.
9. Bake uncovered in the oven for 15 minutes.
10. Pour water into a pan and bring it to a boil at a
medium-to-high heat. Once boiling, add the spaghetti and
cook for 7 minutes.
11. Remove the chicken parmesan from the oven and
set aside to rest for 5 minutes. Drain the spaghetti and divide
it onto plates with the chicken.
12. Finish with a sprinkling of parsley on top.
OceanofPDF.com
Eggplant Caponata
Caponata is typically a side dish in Italy, but it can be used as a main meal
too. It’s a fun dish that is flavorsome and super tasty. Plus, it’s a great
conversation starter to break the ice with guests.
Serving Size: 2
Cooking Time: 40-45 Minutes
Ingredients:
3 sliced celery stalks
18 oz. of crushed tomatoes, canned
1 cubed eggplant
1 chopped red onion
1 cubed bell pepper
1 tablespoon of drained and chopped capers
2 tablespoons of drained and chopped anchovies
½ cup of pitted and chopped olives
3 minced garlic cloves
7 tablespoons of olive oil
5 tablespoons of red wine vinegar
2 tablespoons of honey
4 oz. of chopped basil
1 teaspoon of crushed chili pepper flakes
1 bay leaf
1 teaspoon of ground cumin
1 teaspoon of ground oregano
Cooking spray
Salt and pepper for seasoning
Instructions:
1. Preheat your oven to 425 degrees Fahrenheit and line a
roasting pan or baking sheet with parchment paper. Grease the
paper with cooking spray then add the eggplant to the pan and
drizzle half of the oil over the eggplant.
2. Add a pinch of salt and roast the eggplant in the oven for 15
minutes. Turn the eggplant over then cook for a further 15-20
minutes.
3. Put the remaining oil into a pan and heat it at a medium heat
for 30 seconds. Add the onion, garlic, celery, and bell pepper,
then season them with salt and pepper and cook for 10
minutes. Stir the vegetables often so they don’t burn, then add
the crushed tomatoes, capers, anchovies, olives, red wine
vinegar, honey, cumin, oregano, chili flakes, and bay leaf.
4. Season generously with salt and pepper then bring the mixture
to a simmer at a low-to-medium heat for 10 minutes. Stir
occasionally so that the vegetables don’t burn or stick to the
pan.
5. Remove the eggplant from the oven and set on a cooling rack
for a moment.
6. Carefully discard the bay leaf then add the eggplant to the pan
and cook for 3 minutes more, then remove from the heat and
top with basil to finish.
OceanofPDF.com
Shrimp and Polenta
Luxury on a plate, this shrimp and polenta is just delightful. It’s a gorgeous
Venetian dish that combines creamy polenta with garlic-infused shrimp.
You can’t get a better dish than this. It’s great for busy or lazy days alike
and will liven up mealtimes to keep everyone full and happy.
Serving Size: 4
Cooking Time: 1 Hour
Ingredients:
24 oz. of peeled and deveined shrimp
5 minced garlic cloves
2 teaspoons of ghee
¾ cup of white wine
1 teaspoon of crushed chili flakes
4 tablespoons of olive oil
¼ cup of milk
The juice of 1 lemon
3 tablespoons of chopped parsley
1 teaspoon of sesame seeds
1 finely chopped scallion
4 cups of water
1 cup of cornmeal
1 teaspoon of paprika
1 teaspoon of dried marjoram
2 tablespoons of butter
Salt and pepper for seasoning
Instructions:
1. Preheat your oven to 350 degrees Fahrenheit then add
cornmeal, water, and a pinch of salt to an ovenproof dish.
Whisk well to combine and infuse together, then cover with
aluminum foil and cook for 15-17 minutes. Stir the polenta
well, then cover and continue to cook for 15-17 minutes more.
2. Remove the dish from the oven and place on a cooling rack as
you add the butter, milk, marjoram, paprika, and a pinch of
pepper. Give the polenta a good whisk to help melt and mix
the butter. Cover the polenta again with aluminum foil and
switch off the oven. Put the dish back in the oven to keep
warm for a few minutes.
3. Add oil and garlic to a pan and heat it at a medium
temperature for 1 minute. Add the shrimp and wine and cook
for 2 minutes, then flip them and cook for a further minute.
Add the ghee and swirl the pan every few seconds to help it
melt faster and cover the shrimp. Mix in the lemon juice,
scallions, chili flakes, and parsley, and cook for 1 minute
more.
4. Remove the shrimp from the heat and remove the polenta
from the oven. Divide the polenta onto plates then place the
shrimp on top and sprinkle on some sesame seeds.
OceanofPDF.com
Italian Summer Bake
Loaded with goodness, this Italian summer bake is a breath of fresh air. It’s
summery and will make mealtimes a little more exciting again. Best of all,
you can use almost anything you have in your cupboards. It’s a great dish
that can be adapted to suit whatever you have at home. It’s perfect for most
families and tastes fantastic.
Serving Size: 8-10
Cooking Time: 50-55 Minutes
Ingredients:
2 sliced zucchinis
3 thinly sliced bell peppers
3 small sliced yellow squash
12 oz. of cubed new baby potatoes
8 quartered tomatoes
2 thinly sliced eggplants
32 oz. of marinara sauce
¾ cup of breadcrumbs
1 ½ cups of finely grated parmesan cheese
4 cups of shredded mozzarella cheese
10 oz. of torn spinach leaves
4 oz. of chopped basil
2 grated garlic cloves
1 teaspoon of smoked paprika
2 teaspoons of oregano
3 tablespoons of olive oil
2 teaspoons of garlic powder
1 teaspoon of onion powder
Cooking spray
Salt and pepper for seasoning
Instructions:
1. Preheat your oven to 375 degrees Fahrenheit then grease a
large baking dish with cooking spray.
2. Add the eggplants, tomatoes, baby potatoes, spinach, bell
peppers, zucchinis, and squash to a large mixing bowl and
sprinkle onion powder, grated garlic cloves, olive oil,
oregano, salt, paprika, pepper, and garlic powder on top. Toss
the vegetables to ensure the seasoning reaches everywhere
and the vegetables are mixed up.
3. Pour ¼ of the marinara sauce in the bottom of the baking dish
then add half of the mixed vegetables followed by another ¼
of the sauce. Sprinkle a half of mozzarella on top then add
another ¼ of the sauce.
4. Add the remaining vegetables to the baking dish followed by
the remaining sauce and mozzarella.
5. Combine the breadcrumbs and parmesan and sprinkle over the
vegetables. Bake in the oven for 50-55 minutes then remove
and top with basil to finish.
OceanofPDF.com
Broccoli Pasta with Pecorino Cheese
Broccoli might not inspire ‘fun’ for some but can actually be a versatile and
quality ingredient to work with. Broccoli pasta with pecorino cheese is
beautiful. It tastes delicious and is a great Italian dish that will make
mealtimes a lot more appealing. It’s velvety and rich but balanced perfectly.
Serving Size: 4
Cooking Time: 20 Minutes
Ingredients:
32 oz. of frozen broccoli florets, thawed
24 oz. of fusilli pasta
4 oz. of mint leaves
5 oz. of chopped walnuts
1 ½ cups of finely grated pecorino cheese
3 minced garlic cloves
½ teaspoon of crushed chili pepper flakes
2 tablespoons of olive oil
Salt and pepper for seasoning
Instructions:
1. Fill a large pan ¾ of the way with water and bring it to a boil
at a medium-to-high heat. Once the water boils, add the fusilli
pasta and cook it for 2 minutes, then add the broccoli and
cook for 5 minutes.
2. Put the walnuts into a skillet and gently toast them for 5-7
minutes at a low-to-medium heat. Keep an eye on the walnuts
as they can burn easily so move them often.
3. To a second pan, add the oil and chili flakes and cook them
for 3 minutes at a medium temperature.
4. Remove the broccoli and pasta from the heat and drain them
thoroughly but retain 2 cups of cooking liquid. Add the pasta
and broccoli to the pan with the garlic and pour in 1 ½ cups of
water.
5. Season the pasta with a pinch of salt and pepper, then add the
pecorino cheese to the pan and cook for 3 minutes.
6. Mix the walnuts into the pasta then remove and divide onto
plates. Finish with a few mint leaves on top.
OceanofPDF.com
Italian Chicken Skillet
Playful, delicious, and super easy to make – what else could you want? This
Italian chicken skillet is a gorgeous dish that everyone will love because it
combines the rich flavors of Italy. It’s a great dish to serve when you want
to move from dull to flavorsome.
Serving Size: 4
Cooking Time: 40-45 Minutes
Ingredients:
4 skinless chicken breast fillets
8 oz. of soft cream cheese
18 oz. of crushed tomatoes, canned
1 sliced zucchini
1 sliced bell pepper
8 diced fresh tomatoes
1 peeled and cubed yellow squash
1 sliced white onion
4 tablespoons of olive oil
1 teaspoon of oregano
5 minced garlic cloves
½ teaspoon of ground rosemary
¾ cup of vegetable stock
½ cup of finely chopped basil
Salt and pepper for seasoning
Instructions:
1. Put the chicken into a skillet with oil and gently heat at a
medium-to-high temperature. Season the chicken generously
with some salt and pepper then cook it for a good 8-9
minutes. Turn the chicken over and cook for 8-9 minutes
more.
2. Heat a second skillet at a medium-to-high temperature for 30
seconds, then add the squash, bell pepper, and onion, and
cook for 5 minutes. Then add the zucchini to the skillet and
cook for 4 minutes.
3. Mix the garlic, rosemary, oregano, and a pinch of salt and
pepper in the chicken and let it cook for a further 1-2 minutes
but stir frequently so that the spices release their aromas.
4. Remove the chicken from the heat once cooked, then set it
aside for 10 minutes.
5. Pour the canned and fresh tomatoes, cream cheese, and stock
into the skillet then bring to a boil at a medium temperature.
Season with ¼ teaspoon of salt and a ¼ teaspoon of pepper
and let the mixture simmer for 10 minutes.
6. Mix the basil into the pan with the tomatoes, then add the
chicken and heat it through for a few minutes before serving
up.
OceanofPDF.com
Creamy Salmon Fillet with Herby Mashed Potatoes
Salmon may be a simple ingredient but it never disappoints. This Italian
salmon goes from silver level to gold – it’s that good – and it is light,
creamy, and sinfully indulgent! It’s a dish to adore because it’ll never let
you down and will ensure your family is wowed every time.
Serving Size: 4
Cooking Time: 30 Minutes
Ingredients:
4, 2-inch-thick salmon fillets, with the skin
1 finely diced white onion
1 cup of heavy cream
4 tablespoons of white wine
6 tablespoons of soft unsalted butter
2 oz. of chopped chives
2 oz. of finely chopped cilantro
4 minced garlic cloves
2 tablespoons of olive oil
¼ cup of washed and torn spinach leaves
¼ cup of finely grated parmesan cheese
The juice of 1 lemon
The zest of 1 lemon
24 oz. of peeled and cubed potatoes
1 cup of milk
¼ teaspoon of nutmeg
½ cup of grated pecorino cheese
¼ cup of chopped chives
2 tablespoons of flour
¼ teaspoon of oregano
¼ teaspoon of ground cumin
Salt and pepper for seasoning
Instructions:
1. Add the potatoes to a large pot and fill ¾ to the top with
water. Put a pinch of salt into the water and bring it to a boil at
a medium-to-high heat. Reduce to a medium heat once
boiling, then cook the potatoes for 15-17 minutes or until
they’re soft.
2. Heat olive oil in a large skillet at a medium-to-high
temperature for 60 seconds, then season the salmon with salt
and pepper. Place the salmon (the non-skin side down) into
the skillet and cook the fillets for 6 minutes, then turn and
cook for a further 6 minutes. It’s important you use a large
enough skillet so that the fillets don’t overlap with one
another.
3. Once cooked, remove the salmon from the skillet and set
aside on a cold plate to stop the cooking process.
4. Add 3 tablespoons of butter to the skillet, along with the
onions and garlic, and cook them for 3 minutes. Stir often so
that the butter melts and coats the onions and garlic, then add
the flour and cook for a further 1 minute. Again, you want to
coat the onions and garlic in the flour as best as you can.
5. Pour the wine into the skillet and burn off the alcohol for 1-2
minutes.
6. Stir in the heavy cream, cumin, oregano, lemon zest,
parmesan, and a dash of salt and pepper to create a sauce. Mix
in the spinach then reduce to a medium heat and simmer for 5
minutes, but stir often to prevent the sauce from becoming
clumpy.
7. Put the salmon into the pan and coat the fillets in the sauce.
Pour the lemon juice on top and remove immediately from the
heat.
8. Remove the potatoes from the heat once they’re cooked and
drain thoroughly before putting them back into the pot. Mash
them gently for a few minutes, then pour in the milk, nutmeg,
remaining butter, cilantro, and a pinch of salt and pepper.
Continue to mash the potatoes until they’re creamy and free
from lumps.
9. Fold the pecorino cheese and chives into the potatoes and
serve alongside the salmon.
OceanofPDF.com
Italian Pork and Potato Casserole
Casseroles might not excite most people but this Italian pork and potato is
just gorgeous. It’s tasty and brings an authentic flavor of Italy to your dinner
table. You will love the combination of the pork and potatoes and it’s really
an easy dish to make. It’s perfect for busy households and those with little
time to oversee dinner.
Serving Size: 6-8
Cooking Time: 45-50 Minutes
Ingredients:
52 oz. of peeled and 1-inch sliced potatoes
6 boneless pork loin chops
2 thickly sliced red onions
2 thickly sliced bell peppers
1 peeled and diced carrot
32 oz. of marinara sauce
2 minced garlic cloves
2 teaspoons of oregano
1 teaspoon of cumin
1 teaspoon of ground rosemary
1 teaspoon of chopped thyme
2 diced hot chili peppers
½ cup of finely grated parmesan cheese
Cooking spray
Salt and pepper for seasoning
Instructions:
1. Preheat your oven to 350 degrees Fahrenheit and fill a large
microwave-safe bowl (or casserole dish) with water and
potatoes. Cover them with a lid then cook the potatoes for 5
minutes.
2. Grease a casserole dish with cooking spray then remove the
potatoes from the microwave and drain them. Put the potatoes
into the casserole dish then add carrots, chili peppers, onions,
and bell peppers.
3. Season the vegetables with thyme, cumin, oregano, garlic,
rosemary, and a pinch of salt and pepper. Place the pork chops
on top then pour the marinara sauce on top.
4. Cover the casserole dish with its lid then bake in the oven for
45 minutes.
5. Remove the casserole from the oven and sprinkle parmesan
cheese on top. Bake for a further 5 minutes uncovered.
OceanofPDF.com
Baked Ziti
A classic Italian dish that is beloved by all, this baked ziti is just gorgeous.
It’s rich, highly adaptable, and tastes amazing. Ziti is a dish that is sure to
bring some excitement to mealtimes and most will adore its rich flavors.
Serving Size: 4
Cooking Time: 40-45 Minutes
Ingredients:
18 oz. of passata
14 oz. of ziti noodles
18 oz. of ground beef
1 diced red onion
2 ¼ cup of milk
6 tablespoons of flour
6 tablespoons of butter
1 teaspoon of nutmeg
18 oz. of torn mozzarella cheese
8 oz. of finely grated parmesan cheese
1 teaspoon of oregano
1 teaspoon of ground basil
1 teaspoon of sugar
2 teaspoons of crushed fennel seeds
1 teaspoon of cayenne pepper
Salt and pepper for seasoning
Instructions:
1. To create a homemade ziti sauce, add the onions and butter to
a pan and cook them for 3-4 minutes. Mix the flour into the
onions then add the passata, milk, salt, pepper, sugar, oregano,
basil, and fennel seeds, and bring it to a boil. Reduce to a low
heat and cook for a further 25 minutes. Keep an eye on the
sauce, however, as you don’t want to burn it or let it run dry.
2. Heat a skillet at a medium-to-high temperature for 1 minute
then add the ground beef, cayenne pepper, and a pinch of salt
and pepper, and cook for 6 minutes. Use a spatula or spoon to
break the beef up so that it cooks evenly.
3. Preheat your oven to 350 degrees Fahrenheit then fill a pan ¾
of the way to the top with water. Bring it to a boil at a
medium-to-high heat then add the ziti noodles and cook them
for 4-5 minutes.
4. Remove the noodles and ground beef from the heat and pour
the beef into a deep baking dish. Drain the noodles thoroughly
then add them in with the beef. Season it with nutmeg and a
small pinch of salt and pepper, then add the mozzarella. Mix
well to combine then pour the passata sauce on top.
5. Sprinkle the parmesan across the ziti then cook for a good 20
minutes in the oven.
OceanofPDF.com
Italian Turkey Skillet with Pasta
This Italian turkey and vegetable skillet is a simple yet delightful meal to
make. It’s sure to be a crowd-pleaser, but you could elevate it by adding a
small pasta side dish. While odd to some, pairing turkey with pasta is
perfect as they complement one another beautifully.
It’s a contrast in flavors and textures but it’s gorgeous. This is definitely
going to make mealtimes in your home more enjoyable, especially if you
want to try different flavor combinations.
Serving Size: 6-8
Cooking Time:
Ingredients:
1 cup of peas
10 oz. of grape tomatoes
10 oz. of chopped mushrooms
4 peeled and diced carrots
8 oz. of quartered new baby potatoes
2 diced zucchinis
2 cubed bell peppers
32 oz. of diced tomatoes and their juices, canned
2 diced red onions
¼ cup of red wine
3 minced garlic cloves
18 oz. of ground turkey
¼ teaspoon of nutmeg
16 oz. of fusilli pasta
¼ teaspoon of cinnamon
1 cup of heavy cream
½ teaspoon of garlic powder
¼ teaspoon of onion powder
2 oz. of finely grated parmesan cheese
Salt and pepper for seasoning
Instructions:
1. Add the ground turkey and onion to a large skillet and season
them with cinnamon, nutmeg, salt, and pepper. Cook them for
7 minutes at a medium-to-high heat but stir and break the
turkey up as it cooks. You don’t want clumps to merge, but
rather the turkey to evenly cook.
2. Add the garlic to the skillet and cook for 1 minute, then add
the bell peppers, zucchini, baby potatoes, mushrooms, and
carrots. Pour the wine into the skillet and cook for 3 minutes.
3. Mix the peas and diced tomatoes into the skillet and cook for
10 minutes. Stir the mixture every few minutes so that
nothing burns or sticks to the skillet.
4. Fill a pan ¾ of the way with water, then bring it to a boil at a
medium-to-high temperature. Add the pasta once the water
boils, then cook for 7 minutes.
5. Add heavy cream to a saucepan and heat it at a medium
temperature for 2 minutes, then add the garlic powder and
onion powder and simmer gently. Stir frequently as it comes
to a boil. Then reduce to a low heat and slowly add the
parmesan. Let the cheese melt by constantly stirring for
around 3-4 minutes or until fully melted.
6. Season the sauce with salt and pepper, then cook for 1 minute
more.
7. Drain the pasta and pour it into the creamy sauce.
8. Remove the turkey and vegetable skillet from the heat and
divide onto plates. Serve alongside the fusilli pasta and top
with grape tomatoes to finish.
OceanofPDF.com
Mushroom and Asparagus Orzo Bake
Orzo bakes don’t come any better than this one. It’s full of flavor and really
hits every note beautifully. You will adore the combination of flavors and
it’s something different that will make mealtimes more enjoyable.
Serving Size: 4
Cooking Time: 30-35 Minutes
Ingredients:
8 oz. of baby spinach
18 oz. of trimmed asparagus
18 oz. of orzo pasta
2 chopped white onions
16 oz. of chopped button mushrooms
½ cup of peas
4 cups of vegetable broth
½ cup of white wine
¾ cup of breadcrumbs
¾ cup of pitted and chopped black olives
¾ cup of finely grated mozzarella cheese
3 oz. of grated parmesan cheese
1 teaspoon of paprika
4 teaspoons of chopped cilantro
3 tablespoons of butter
Instructions:
1. Preheat your oven to 400 degrees Fahrenheit and put a baking
dish into the oven to heat through for 10 minutes.
2. Pour the orzo and broth into a pan and bring it to a boil at a
medium-to-high heat. Once the broth has boiled, reduce to a
medium heat and cook a for a further 8 minutes. It’s important
to stir the orzo often so that it doesn’t stick to the bottom of
the pan.
3. Add butter and onions to a saucepan and cook them for 5-6
minutes at a medium heat. Put the mushrooms into the pan
and cook for 5 minutes.
4. Stir and coat the mushrooms in the butter before adding the
peas and wine. Season the mixture with salt, pepper, and
paprika, and continue to cook them for a further 5 minutes.
5. Pour the orzo and broth into the saucepan and stir it into the
mushroom mixture for 1 minute. Add the baby spinach and
asparagus and cook for 30 seconds more.
6. Take the baking dish from the oven and place it onto a cooling
rack for a moment. Carefully pour the orzo mixture into the
baking dish and mix in the olives and mozzarella.
7. Sprinkle the parmesan and breadcrumbs over the orzo then
bake uncovered for 20 minutes.
8. Remove and divide onto plates before topping with some
cilantro to finish.
OceanofPDF.com
Chicken with Cheesy Broccoli and Rice
You can’t go wrong with chicken for dinner because it’s adaptable and
works with most other ingredients. Best of all, this Italian-inspired chicken
with cheesy broccoli and rice is a beautiful dish that will leave you wanting
more.
Serving Size: 6
Cooking Time: 35-40 Minutes
Ingredients:
6 boneless and skinless chicken breast fillets
6 teaspoons of Dijon mustard
6 grated garlic cloves
2 thinly sliced red onions
2 thinly sliced tomatoes
¼ cup of finely chopped parsley
52 oz. of chopped broccoli florets
2 cups of long-grain rice
3 cups of water
1 small diced white onion
2 cups of green beans
5 tablespoons of flour
5 tablespoons of butter
2 ¼ cups of milk
2 ¼ cups of finely shredded cheddar cheese
¼ cup of soft cream cheese
1 teaspoon of mustard powder
½ teaspoon of paprika
Salt and pepper for seasoning
Instructions:
1. Add 3 cups of water and 2 cups of rice to a saucepan and
bring it to a boil at a medium heat. Once the water boils,
reduce to a low heat then cover and cook for 15 minutes or
until the water has been absorbed.
2. Preheat your oven to 350 degrees Fahrenheit then add the
diced onion and butter to a saucepan and cook them at a lowto-medium heat for 5 minutes. Add mustard powder, flour,
and a pinch of salt and pepper, and cook for 3 minutes more.
3. Slowly pour the milk into the pan and whisk until combined.
Increase to a medium heat and continue to stir until it thickens
which could take up to 2 or 3 minutes. Remove the pan from
the heat, then add the paprika, cream cheese, and cheddar
cheese. Continue to stir until the cheese melts and creates a
sauce.
4. Add the broccoli to the pan with the rice and cook it for 3-4
minutes, then remove them from the heat and drain them.
Pour the broccoli and rice into a large baking dish and top
with the cheese sauce. Place the cheesy broccoli and rice into
the oven to bake for 35-40 minutes.
5. Slit a pocket into each chicken fillet and rub some garlic and a
teaspoon of mustard in them.
6. Slit a pocket into chicken fillets then add a teaspoon of
mustard and some garlic to each piece of chicken. Rub the
extra mustard on top and sprinkle some salt and pepper on
top. Loosely wrap the chicken in aluminum foil then put them
onto a large baking dish.
7. Add the green beans, onions, and tomatoes to the dish and
bake uncovered for 25-30 minutes or until cooked through.
8. Remove the chicken from the oven and let it rest for 5
minutes, then remove the broccoli and rice from the oven and
divide onto plates. Put the chicken on top and finish with a
sprinkle of parsley.
OceanofPDF.com
Slow-Cooked Lamb with Vegetables
While lamb would be a preferred option for Eastertime in Italy, this works
for any special occasion or Sunday roast. This slow-cooked lamb with
vegetables is a beautiful meal to share with your family. It’s tender and so
tasty and is a great choice when you want to make a special dish.
Serving Size: 6
Cooking Time: 4 Hours
Ingredients:
52 oz. of boneless leg of lamb
The juice of 3 lemons
5 tablespoons of olive oil
The zest of 1 lemon
1 cup of vegetable stock
12 oz. of cherry tomatoes
10 oz. of halved baby potatoes
8 oz. of trimmed button mushrooms
1 cubed zucchini
1 cubed small yellow squash
1 tablespoons of ground oregano
2 teaspoons of paprika
2 teaspoons of crushed red chili pepper flakes
3 teaspoons of finely chopped thyme
½ cup of vegetable oil
½ cup of finely chopped rosemary
7 grated garlic cloves
½ cup of mint sauce
Salt and pepper for seasoning
Instructions:
1. Preheat your oven to 325 degrees Fahrenheit then score the
top of the lamb lightly with a knife.
2. Combine lemon juice, oil, lemon zest, rosemary, garlic, and a
pinch of salt and pepper to create a rub for the lamb. Pour the
rub over the lamb and use your hands to work it into the
scoring.
3. Place the lamb into a roasting pan and pour the vegetable
stock into the pan as well. Cover with aluminum foil and roast
for 3 hours and 30 minutes. Remove the foil and cook
uncovered for a further 30 minutes.
4. To create a seasoning mix for the vegetables, combine
paprika, oregano, chili flakes, thyme, and some salt and
pepper in a measuring jug.
5. Add the mushrooms, tomatoes, potatoes, squash, and zucchini
to a second roasting pan and drizzle vegetable oil on top.
Sprinkle the seasoning mix over the vegetables and toss to
combine, then roast them in the oven for 10 minutes.
6. Turn the vegetables over and continue to cook for a further
20-25 minutes or until cooked through.
7. Remove the lamb from the oven and let it rest for 10 minutes
before slicing and serving with vegetables and some mint
sauce on the side.
OceanofPDF.com
Summer Bake
With great Italian influences, this vegetable bake is great for any busy or
slow evening. It’s perfect for vegetarians and meat eaters alike and has a
beautiful array of flavors. This Italian bake works well for households and
is convenient but super tasty.
Serving Size: 4
Cooking Time: 1 Hour
Ingredients:
16 oz. of rinsed and drained cannellini beans
16 oz. of diced tomatoes, canned
2 quartered red onions
32 oz. of cubed potatoes
2 sliced bell peppers
1 thinly sliced zucchini
1 thinly sliced eggplant
¼ cup of vegetable broth
3 grated garlic cloves
1 teaspoon of sugar
2 teaspoons of crushed red chili pepper flakes
2 teaspoons of ground oregano
2 teaspoons of ground basil
1 teaspoon of ground rosemary
2 teaspoons of onion powder
2 teaspoons of Italian seasoning
1 ½ teaspoons of garlic powder
1 minced green chili pepper
¾ cup of breadcrumbs
½ cup of finely grated parmesan cheese
Salt and pepper for seasoning
Instructions:
1. Preheat your oven to 400 degrees Fahrenheit then combine
garlic powder, chili flakes, onion powder, basil, chili peppers,
oregano, rosemary, and Italian seasoning to create a spice
mix.
2. Add tomatoes to a baking dish and sprinkle sugar on top (as
this will cancel out the acidity of the tomatoes). Then add the
onions, potatoes, bell peppers, garlic, eggplant, and zucchini
to the dish. Toss to mix then pour the vegetable broth on top.
3. Sprinkle the spice mix over the vegetables then cover with
aluminum foil and bake for 40-45 minutes.
4. Take off the foil and incorporate the cannellini beans into the
mixture. Then, scatter breadcrumbs and Parmesan cheese over
it and continue to bake for another 20 minutes, or until the
crust becomes golden brown and deliciously melty.
OceanofPDF.com
Spaghetti Bolognese with Chili Peppers and
Parmesan
Spaghetti Bolognese is one of the most famed pasta dishes Italy has to offer
and it’s adored by many. It can, however, be tweaked in dozens of ways to
keep it fun. This Bolognese with chili peppers and parmesan is fantastic and
will make mealtimes a lot more appealing.
Serving Size: 4
Cooking Time: 45 Minutes
Ingredients:
16 oz. of ground beef
16 oz. of spaghetti noodles
2 tablespoons of olive oil
2 diced shallots
5 grated garlic cloves
24 oz. of crushed tomatoes, canned
1 cup of red wine
2 tablespoons of tomato puree
3 oz. of finely chopped basil
2 teaspoons of dried oregano
1 finely diced red bell pepper
2 finely diced jalapenos
½ teaspoon of crushed pepper flakes
2 drained and finely chopped anchovies
8 oz. of chopped white mushrooms
1 teaspoon of sugar
½ cup of heavy cream
¼ cup of grated parmesan
Salt and pepper for seasoning
Instructions:
1. Add oil and beef to a skillet and season with a pinch of salt
then cook them at a medium-to-high heat for 5 minutes. Put
the shallots and garlic into the skillet and cook for a further 3
minutes.
2. Mix in the oregano, chili flakes, and tomato puree and stir
well for 1 minute. Pour the wine into the skillet and cook for
5-7 minutes, then mix in the anchovies, tomatoes, bell
peppers, mushrooms, jalapenos, basil, sugar, and a pinch of
pepper.
3. Bring the beef Bolognese to a boil then reduce to a low heat
and simmer gently for a good 20-22 minutes.
4. Put the spaghetti into a pan filled with water and bring it to a
boil. Once boiled, let the spaghetti cook for around 6-7
minutes. Once cooked, drain the pasta in a colander and set it
aside for a moment.
5. Pour the heavy cream and half of the parmesan into the
Bolognese and mix well to create a creamy sauce. Let the
sauce heat through for 1-2 minutes then add the spaghetti and
toss to mix through the sauce and Bolognese.
6. Remove the spaghetti Bolognese from the heat and divide it
into plates. Finish by sprinkling the remaining parmesan on
top.
OceanofPDF.com
Italian Sausage Casserole
Want a family dinner that’s easy to make but has great Italian flavors? Well,
this Italian sausage casserole is perfect. It combines beautiful flavors and is
incredibly easy to make too. You will love this casserole and it’ll make
dinnertime fun.
Serving Size: 6-8
Cooking Time: 40 Minutes
Ingredients:
2 peeled and diced carrots
8 oz. of chopped button mushrooms
2 diced bell peppers
1 diced chili pepper
¼ cup of beef stock
24 oz. of sliced Italian sausages
18 oz. of chopped cauliflower
12 oz. of chopped broccoli florets
½ cup of finely chopped parsley
10 oz. of shredded mature cheddar cheese
8 oz. of soft cream cheese
1 tablespoon of olive oil
Salt and pepper for seasoning
Instructions:
Preheat your oven to 375 degrees Fahrenheit then pour oil into a large
skillet. Heat the oil at a medium-to-high temperature for 1 minute then add
the carrots, mushrooms, bell peppers, chili pepper, broccoli, and stock, and
cook for 7 minutes.
Add the sausages to the skillet, season them with salt and pepper and cook
them for 10 minutes. It’s important you move and flip the sausages every
few minutes so that they brown evenly. Then mix the cream cheese into the
skillet and let it melt for 1-2 minutes.
Put the cauliflower into a blender and blitz it for 30-40 seconds or until fine
rice-like grains form.
Remove the sausages and vegetables from the heat then pour them into a
baking dish. Sprinkle half of the cheddar cheese into the dish and mix
around with the sausages and vegetables. Add the cauliflower rice and
remaining cheese then cover and bake for 25 minutes.
Remove the bake from the oven and cook uncovered for a further 10-15
minutes. Finish with a sprinkle of parsley on top.
OceanofPDF.com
Chocolate Pudding (Budino al Cioccolato)
Indulgent, rich, and ever so tasty, this Italian pudding is one you don’t want
to miss out on. Budino al cioccolato is a perfect dessert for chocolate lovers
everywhere and you’ll love the silky-smooth texture of the pudding.
Serving Size: 4
Cooking Time: 10 Minutes
Ingredients:
5 oz. of chopped dark chocolate
7 tablespoons of butter
½ cup of caster sugar
1 ¾ cups of milk
3 tablespoons of cornstarch
4 mint leaves
Instructions:
1. Add the butter to a saucepan and let it melt for 1-2 minutes at
a medium heat. Stir it every so often to speed up the melting
process and ensure the butter doesn’t burn.
2. Slowly pour and whisk the sugar into the melted butter for a
minute or until it begins to thicken. Reduce to a low heat then
add the chocolate and stir for a good 3-5 minutes until it fully
melts. You must stir constantly as the chocolate melts so that
it doesn’t burn.
3. Pour the milk into a second saucepan and gently bring it to the
boil at a medium heat. It may take around 2-3 minutes to do
so.
4. Once the chocolate has melted, sift in the cornstarch and stir
for a good minute to ensure no lumps remain.
5. Remove the milk from the heat and slowly (and carefully)
pour it into the chocolate mixture. It’s important to do this
slowly otherwise the mixture might curdle. Increase to a
medium heat and continue stirring for 4-5 minutes or until the
chocolate pudding begins to thicken up.
6. Remove the pudding from the heat and carefully spoon it into
dessert glasses then set it aside to chill for an hour at room
temperature. Then put the pudding into the refrigerator for a
further 3 hours to firm up fully.
7. Serve with a few mint leaves on top to finish.
OceanofPDF.com
Lemon Olive Oil Cake
Never had an olive oil cake? Well, you’ve been missing out because it’s one
of the best desserts to make at home. It’s a traditional cake of Italy and it is
truly sublime. This lemon olive oil cake is moist and surprisingly light but
has just the right amount of sweetness to it.
Serving Size: 8-10
Cooking Time: 1 Hour 15 Minutes
Ingredients:
2 ¼ cups of flour
2 cups of granulated sugar
1 ½ cups of whole milk
1 ½ cups of virgin olive oil
3 eggs
½ teaspoon of baking soda
½ teaspoon of baking powder
½ cup of limoncello
The zest of 1 lemon
½ cup of lemon juice
¼ teaspoon of salt
¼ cup of confectioners’ sugar
Cooking spray
Instructions:
1. Preheat your oven to 325 degrees Fahrenheit then line a
circular 9-inch springform pan with parchment paper. Grease
the paper with cooking spray and set the pan to one side for a
few moments.
2. Crack the eggs into a mixing bowl then add the oil and whisk
them for 30-40 seconds or until they have incorporated with
one another. Add the milk, lemon juice, lemon zest, and
limoncello to the bowl and whisk well for a further 30
seconds.
3. Slowly pour the granulated sugar into the mixture, along with
the flour, salt, baking powder, and baking soda, then whisk
well until a thin batter forms. This might take 2 or 3 minutes
to achieve.
4. Pour the batter into the springform pan and smooth it out with
a spoon or spatula. Gently bang the pan on your worktop so
that you can release air trapped in the batter.
5. Place the cake in the oven to bake for 1 hour and 15 minutes.
You should, however, check on the cake after 1 hour as it can
cook faster depending on your appliance. Use a toothpick to
check on the cake: a clean toothpick indicates it’s cooked
inside.
6. Once cooked, remove the cake from the oven and set it aside
to cool on a cooling rack for 50-60 minutes. Remove the cake
from the springform pan and dust it with confectioners’ sugar
to finish.
OceanofPDF.com
Anise Biscotti
Biscotti is a classic Italian treat that’s beloved around the world and it never
fails to hit the mark. It’s fun, tasty, and adaptable, and there’s nothing better
than making these at home. Biscotti is perfect with coffee or if you’re
looking for a lighter dessert. Better still, anise biscotti is just gorgeous.
Anise has a very distinct licorice flavor profile and it’s really beautiful. It’s
sweet but not overpowering and great for those who love bold flavors.
Serving Size: 10-12
Cooking Time: 40 Minutes
Ingredients:
¾ cup of soft butter
2 ¾ cups of all-purpose flour
2 teaspoons of crushed anise seeds
5 teaspoons of baking powder
3 eggs
1 ¼ cup of sugar
1 ¼ cup of almonds
1 tablespoon of milk
1 teaspoon of anise extract
¼ teaspoon of vanilla extract
½ teaspoon of nutmeg
½ teaspoon of cinnamon
¼ teaspoon of salt
Instructions:
1. Add the almonds to a skillet and toast them gently at a low-tomedium heat for 10 minutes. It’s important to stir and move
them often so they don’t burn. Once toasted, remove the
almonds from the heat and set them on a chopping board to
cool down for a few minutes, then chop them finely.
2. Preheat your oven to 375 degrees Fahrenheit and line 2
baking sheets with parchment paper or silicone cooking mats.
3. In a bowl, combine nutmeg with flour, cinnamon, salt, baking
powder, and anise seeds, then set the mixture aside for a few
minutes.
4. To a stand mixer, add the butter and 1 cup of sugar, then
cream them for 2-3 minutes or until they’re nice and fluffy.
Crack each egg into the mixer then add the vanilla extract and
anise extract and beat them for a further 30-40 seconds until
they’re incorporated into the butter mixture.
5. Add the almonds and flour mixture to the stand mixer and
combine them until a dough forms.
6. Split the dough into 2 pieces and shape them into semi-thick
large squares. Ideally, you want each piece of dough to be of
equal size and weight otherwise cooking times might vary.
7. Put each piece of dough onto a baking sheet then brush them
with milk and sprinkle the remaining sugar on top. Place the
biscotti into the oven to bake for 12-15 minutes.
8. Remove the biscotti from the oven (and remove them from
the baking sheets too) and set them on a cooling rack for 20
minutes. Reduce your oven to 300 degrees Fahrenheit then
slice the biscotti into rectangles and bake them for a further 8
minutes.
9. Once crispy, remove the biscotti from the oven and let them
cool down for 30 minutes before serving.
OceanofPDF.com
Pignoli
Pignoli is a classic Italian dessert that will impress and spoil those around
your dinner table. These are soft and chewy with a beautiful crispy outer
layer. It’s one you’ll adore and are great for those with a sweet tooth.
Serving Size: 16
Cooking Time: 20-25 Minutes
Ingredients:
1 ¾ cups of granulated sugar
18 oz. of almond paste
8 oz. of pine nuts
4 egg whites
¼ teaspoon of salt
Instructions:
1. Preheat your oven to 350 degrees Fahrenheit and line 2
baking sheets with parchment paper.
2. To a food processor, add the almond paste and pulse it for 10-
12 seconds. Pour the sugar and salt into the processor and
pulse for a further 45 seconds.
3. Add 2 egg whites to the processor then mix for a further 30
seconds. Pour the remaining egg whites into the processor and
mix for a further 30-60 seconds or until a dough-like texture
forms.
4. Remove the pignoli dough from the food process and split it
into small circles. Roll each pignoli circle into the pine nuts to
form the crispy outer coating. Place the pignoli onto the
baking sheets but space them apart as they can expand as they
cook.
5. Put the pignoli into the oven for 15 minutes, then remove
them and let them cool down for 30 minutes before serving
them.
OceanofPDF.com
Zeppole
For those who want a dessert that is tasty and indulgent, but not too heavy,
then zeppole is perfect. Zeppole is a beautiful deep-fried dough ball that is
light and full of flavor. It’s incredibly tasty and these make a wonderful
after-dinner treat.
Serving Size: 8-10
Cooking Time: 20 Minutes
Ingredients:
½ cup of confectioners’ sugar
1 ½ cups of all-purpose flour
¾ cup of soft butter
5 eggs
1 ¼ cup of water
½ teaspoon of salt
1 cup of olive oil
5 tablespoons of sugar
Instructions:
1. Preheat your deep-fat fryer to 375 degrees Fahrenheit then
add water, butter, sugar, and salt to a saucepan. If you don’t
have a fryer, fill a pot with 1 or 2 cups of oil and heat it until
it reaches 375 degrees Fahrenheit. Please note that you will
need a cooking thermometer to check the temperature.
2. Heat the butter and water mixture at a medium temperature
for 2-3 minutes. Stir constantly so that the butter and sugar
incorporate fully with the water. Once combined, reduce to a
low heat and slowly stir the flour into the pan until a dough
forms.
3. Remove the dough from the heat and carefully put it into a
bowl. Set the dough aside for 5-7 minutes to cool down.
4. Once cooled, carefully crack and mix the eggs (one at a time)
into the dough. Use a wooden spoon to combine the eggs into
the dough and be thorough. You don’t, however, want to add
the eggs if the dough is still warm otherwise the eggs will
cook and curdle.
5. Scoop a tablespoon or two of batter and shape it into a donut
or ball. Continue to do this until you have used all of the
batter to create the zeppole. Place them on a plate and set up a
wire cooling rack.
6. Put 5 zeppole dough pieces into the fryer and cook them for 6
minutes. Turn the zeppole over every 1-2 minutes until both
sides are golden brown. Once cooked, remove the zeppole
with a slotted spoon and place them on the wire rack to drain
excess oil from them.
7. Repeat the process until you have used up all of the zeppole
batter. Dust the zeppole with confectioners’ sugar to finish.
OceanofPDF.com
